<?xml version="1.0" encoding="utf-8"?>
 <rss xmlns:atom="http://www.w3.org/2005/Atom" version="2.0">
 <channel>
   <title>Datawarehouse f&#225;cil</title>
   <atom:link href="https://datawarehouse.es/rss.xml" rel="self" type="application/rss+xml" />
   <link>https://datawarehouse.es</link>
   <description></description>

 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2014/design-tip-tabla-puente.html</guid>
      <link>https://datawarehouse.es/2014/design-tip-tabla-puente.html</link>
      <title>Consejo de dise&#241;o #166: Alternativas de la tabla puente (bridge table) </title>
      <pubDate>Sun, 16 Apr 2017 23:23:25 GMT</pubDate>
      <atom:updated>2017-04-16T23:23:25Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/2014-design-tip-tabla-puente.jpg&quot; /&gt;
	  &lt;h3&gt;El reto de las relaciones M-N&lt;/h3&gt;
&lt;p&gt;Los dise&#241;os dimensionales a menudo necesitan adecuar las dimensiones multivalor. Los pacientes pueden tener m&#250;ltiples diagn&#243;sticos. Los estudiantes pueden tener m&#250;ltiples especialidades. Los consumidores pueden tener m&#250;ltiples hobbies o intereses. Los clientes comerciales pueden tener m&#250;ltiples clasificaciones en la industria. Los empleados pueden tener m&#250;ltiples habilidades o certificaciones. Los productos pueden tener m&#250;ltiples caracter&#237;sticas opcionales. Las cuentas bancarias pueden tener m&#250;ltiples clientes. Las dimensiones multivalor son un dilema natural e inevitable en todo tipo de industrias.&lt;/p&gt;
&lt;p&gt;Un enfoque com&#250;n para manejar las dimensiones multivalor es introducir una tabla puente. La siguiente figura muestra una tabla puente para asociar m&#250;ltiples clientes con una cuenta.&lt;/p&gt;
&lt;p&gt;&lt;img src=&quot;../images/bridge.png&quot; alt=&quot;Tabla puente&quot; title=&quot;Tabla puente&quot; /&gt;&lt;/p&gt;
&lt;p&gt;En este caso, la tabla puente contiene una fila para cada cliente asociado a una cuenta. De manera similar, una table puente puede tener una fila para cada habilidad dentro de un grupo de habilidades de clientes. O una fila para cada opci&#243;n  en un grupo de caracter&#237;sticas de producto. Las tablas puente pueden situarse entre tablas de hecho y de dimensiones o, alternativamente, entre una tabla dimensional y sus atributos multivalor (como un cliente y sus hobbies o intereses).&lt;/p&gt;
&lt;p&gt;La tabla puente es un modo potente de gestionar dimensiones que contienen valores m&#250;ltiples cuando se asocia con el granulado de la medici&#243;n de una tabla de hechos. Es escalable y flexible para manejar un n&#250;mero abierto de valores. Por ejemplo, puedes asociar f&#225;cilmente muchos diagn&#243;sticos con un paciente hospitalario, y los nuevos diagn&#243;sticos son f&#225;cilmente situados sin alterar el dise&#241;o de la base de datos. Sin embargo, las tablas puente tienen sus desventajas:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;La facilidad de uso se ve comprometida frecuentemente, especialmente cuando algunas herramientas BI luchan para generar SQL que crucen el puente con &#233;xito.&lt;/li&gt;
&lt;li&gt;Otro resultado no deseado es el recuento excesivo que sucede cuando se agrupa por dimensiones multivalor, ya que en una tabla simple cada registro puede estar relacionado con m&#250;ltiples filas de dimensiones y se produce una sobrevaloraci&#243;n del resultado (a menos que se asigne un factor de ponderaci&#243;n a cada fila de la tabla puente).&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Aqu&#237; tenemos varias t&#233;cnicas posibles para evitar las tablas puente. Sin embargo, sed conscientes de que cada una conlleva sus desventajas, tambi&#233;n.&lt;/p&gt;
&lt;h3&gt;1. Altera la granularidad de la tabla de hechos para resolver la valiosa relaci&#243;n ponderando las m&#233;tricas de modo acorde&lt;/h3&gt;
&lt;p&gt;Las relaciones “many-to-many” normalmente se resuelven bien en las tablas de hechos. Por ejemplo, si m&#250;ltiples representantes se asocian con una transacci&#243;n de ventas, debes poder definir la granularidad de la tabla de hechos para que exista una fila por representante por transacci&#243;n de venta, y despu&#233;s ponderar la cantidad vendida por columna. Mientras que un granulo m&#225;s natural ser&#237;a una fila por transacci&#243;n de venta, subdividir el granulo podr&#237;a parecer l&#243;gico para los usuarios de negocio en este escenario.&lt;/p&gt;
&lt;p&gt;En otras situaciones, esta t&#233;cnica no tendr&#237;a sentido. Por ejemplo, si necesitas representar los m&#250;ltiples hobbies de los clientes, no tendr&#237;a sentido adoptar un granulo por fila por hobby de cliente por transacci&#243;n de venta. &#161;Eso ser&#237;a un granulo no natural!&lt;/p&gt;
&lt;h3&gt;2. Designa un valor primario&lt;/h3&gt;
&lt;p&gt;Establecer un diagnostico inicial, un titular de la cuenta principal, una especialidad principal, etc. ya sea con una simple clave for&#225;nea en la tabla de hechos (o un atributo simple en la tabla de dimensiones) elimina el problema multi-valor. En  este escenario, todas los nombres de las columnas de atributos ser&#225;n precedidos por la palabra “principal”. Por supuesto, acertar con las reglas del negocio para determinar la relaci&#243;n principal puede ser imposible. Y el subsecuente an&#225;lisis basado &#250;nicamente en la relaci&#243;n principal estar&#225; incompleto o err&#243;neo (ya que los restantes valores de la dimensi&#243;n multivalor ser&#225;n ignorados).&lt;/p&gt;
&lt;h3&gt;3. A&#241;ade m&#250;ltiples atributos nombrados  a la tabla de dimensiones&lt;/h3&gt;
&lt;p&gt;Por ejemplo, si vendes suministros para mascotas, debes incluir una bandera en la dimensi&#243;n del cliente para designar a los compradores de perros, compradores de gatos, compradores de aves, etc. No estamos sugiriendo que incluyas 10 columnas etiquetadas gen&#233;ricamente, como comprador de animales 1, comprador de animales 2, etc.&lt;/p&gt;
&lt;p&gt;Este dise&#241;o es atractivo porque es f&#225;cil de consultar con cualquier herramienta BI con un excelente y predecible rendimiento para la consulta. Sin embargo, s&#243;lo es apropiado para un n&#250;mero fijo y limitado de opciones. No deber&#237;as incluir 150 columnas diferentes en una dimensi&#243;n para estudiantes, como por ejemplo en la especialidad de historia, para cada especialidad universitaria posible.&lt;/p&gt;
&lt;p&gt;Este enfoque no es muy escalable, ya que los nuevos valores requieren alterar la tabla.&lt;/p&gt;
&lt;h3&gt;4. A&#241;adir una cadena de texto concatenado los valores de la dimensi&#243;n&lt;/h3&gt;
&lt;p&gt;Por ejemplo, si los cursos pueden ser impartidos de forma dual, debes concatenar los nombres de los instructores en un &#250;nico atributo, como &lt;em&gt;|MRoss|RKimball|&lt;/em&gt;. Necesitar&#237;as un delimitador como un retroceso o una barra vertical al inicio de la cadena y despu&#233;s de cada valor. Este enfoque permite que el valor concatenado sea f&#225;cilmente mostrado en un an&#225;lisis. Pero existen desventajas obvias:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Las consultas necesitar&#237;an hacer una b&#250;squeda comod&#237;n con contenidos/preferencias y este tipo de consultas tieen un rendimiento notablemente lento.&lt;/li&gt;
&lt;li&gt;Habr&#237;a ambig&#252;edad alrededor de los valores superiores e inferiores en la cadena concatenada.&lt;/li&gt;
&lt;li&gt;No ser&#237;a apropiado para una lista larga de atributos.&lt;/li&gt;
&lt;li&gt;Finalmente, no podr&#237;as contar/sumar f&#225;cilmente los registro para cada grupo.&lt;/li&gt;
&lt;/ol&gt;
&lt;h3&gt;Conclusi&#243;n&lt;/h3&gt;
&lt;p&gt;Las dimensiones multivalor son una realidad para muchos dise&#241;adores. La t&#233;cnica de la tabla puente y las alternativas discutidas en este &amp;quot;Consejo de dise&#241;o&amp;quot; tienen sus m&#225;s y sus menos. No hay una &#250;nica estrategia correcta; necesitar&#225;s determinar con que compromisos tienes que trabajar. Finalmente, estas t&#233;cnicas no son mutuamente excluyentes. Por ejemplo, los modelos dimensionales a menudo incluyen una dimensi&#243;n “primaria” con una &#250;nica clave for&#225;nea en la tabla de hechos, emparejada con una tabla puente para representar las dimensiones multivalor.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/cajas-analiticas.html</guid>
      <link>https://datawarehouse.es/2015/cajas-analiticas.html</link>
      <title>Consejo de dise&#241;o #174: &#191;Tu organizaci&#243;n necesita una &#39;analytical sandbox&#39;?</title>
      <pubDate>Wed, 12 Apr 2017 01:54:00 GMT</pubDate>
      <atom:updated>2017-04-12T01:54:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/2015-cajas-analiticas.jpg&quot; /&gt;
	  &lt;p&gt;Innumerables organizaciones han creado data warehouses dimensionales y est&#225;n considerados como grandes &#233;xitos dentro de sus organizaciones. Estos entornos de data warehouse respaldan los informes clave y los requisitos de an&#225;lisis para la empresa. Muchos son capaces de dar apoyo al acceso autosuficiente a los datos y a las capacidades de an&#225;lisis para usuarios de negocio dispares.&lt;/p&gt;
&lt;p&gt;Sin embargo, pese al &#233;xito obtenido por estos data warehouses dimensionales, son a veces criticados por ser demasiado lentos en reaccionar a los nuevos requisitos, implementar nuevas fuentes de datos y respaldar las nuevas capacidades de an&#225;lisis. A veces estas preocupaciones son exageradas, ya que claramente se necesita un cierto per&#237;odo de tiempo para reaccionar a los nuevos requisitos, pero otras veces estas cr&#237;ticas son ciertas. Muchos data warehouses han crecido y evolucionado para llegar a ser entornos de misi&#243;n cr&#237;tica que respaldan los informes de empresa clave, cuadros de mando, scorecards y capacidades de  acceso autoservicio a los datos. Debido a la naturaleza de misi&#243;n cr&#237;tica, el modelado dimensional, la direcci&#243;n, el desarrollo de reglas ETL, y los cambios en los requisitos de gesti&#243;n desembocan en una aprobaci&#243;n larga, ciclos de dise&#241;o y desarrollo para los nuevos requisitos y cambios. En muchos sentidos, estos desaf&#237;os son el precio del &#233;xito.&lt;/p&gt;
&lt;p&gt;El data warehouse es probable que est&#233; muy estructurado, cuidadosamente dise&#241;ado, sujeto a reglas de negocio bien definidas, y estrechamente dirigido por la empresa. Gran parte de los datos del data warehouse se limpian y transforman de forma intensiva para asegurar que ofrecen una imagen fiel de lo que pasa actualmente en el negocio. Adem&#225;s, los datos del data warehouse se sincronizan frecuentemente con los entornos de producci&#243;n v&#237;a cargas programadas regularmente. De esta manera, al final, es bastante r&#237;gido; simplemente lleva tiempo reaccionar a los nuevos datos y las solicitudes anal&#237;ticas.&lt;/p&gt;
&lt;p&gt;En el mundo competitivo de hoy en d&#237;a, las organizaciones necesitan ser todav&#237;a m&#225;s &#225;giles. Quieren comprobar r&#225;pidamente las nuevas ideas, nuevas hip&#243;tesis, nuevas fuentes de datos y nuevas tecnolog&#237;as. La creaci&#243;n de una caja anal&#237;tica (data sandbox)  puede ser una respuesta apropiada a estos requerimientos. Una caja anal&#237;tica complementa el data warehouse dimensional. No se destina a reemplazar el data warehouse, sino que se mantiene a su lado y proporciona un entorno que puede reaccionar m&#225;s r&#225;pidamente a los nuevos requerimientos. La caja anal&#237;tica no es un concepto realmente nuevo, pero en los recientes debates sobre grandes datos han puesto el concepto de nuevo en vanguardia. &lt;strong&gt;Normalmente se considera que una caja anal&#237;tica es un &#225;rea situada fuera de la infraestructura existente en el data warehouse o como un entorno separado adyacente al data warehouse. Proporciona el entorno y los recursos requeridos para apoyar las capacidades anal&#237;ticas experimentales o de desarrollo.&lt;/strong&gt; Es un lugar donde estas nuevas ideas, hip&#243;tesis, fuentes de datos y herramientas pueden ser utilizadas, probadas, evaluadas y exploradas. Mientras tanto, el data warehouse se mantiene como el pre-requisito de la fundaci&#243;n de datos que contiene los datos hist&#243;ricos precisos que los esfuerzos de la caja anal&#237;tica hace girar alrededor y en contra.&lt;/p&gt;
&lt;p&gt;A veces, los datos del entorno de data warehouse existente alimentan la caja anal&#237;tica y se alinea con otros almacenes cuyos datos no est&#225;n a&#250;n en el DWH. Es un lugar donde las nuevas fuentes de datos pueden ser probadas para determinar su valor para la empresa. Un ejemplo de estas nuevas fuentes de datos puede ser la inteligencia de mercado adquirida externamente, atributos de los consumidores adquiridos externamente, o fuentes como interacciones en las redes sociales, interacciones con las aplicaciones m&#243;viles y la actividad web. A menudo ser&#237;a muy costoso traer estas nuevas fuentes de datos al entorno de data warehouse existente a menos que (o hasta que) se pruebe su validez. Los datos de la caja anal&#237;tica no necesitan estar sincronizados sobre una base recurrente con un entorno de producci&#243;n y estos conjuntos de datos expiran con el paso del tiempo.&lt;/p&gt;
&lt;p&gt;Un objetivo clave de la caja anal&#237;tica es comprobar cierta variedad de hip&#243;tesis sobre los datos y anal&#237;ticas. De esta manera, no deber&#237;a ser una gran sorpresa que la mayor&#237;a de proyectos de caja anal&#237;tica terminen en fracaso. Eso significa que la hip&#243;tesis no funciona como se esperaba. Esta es una de las grandes ventajas del &lt;em&gt;sandbox&lt;/em&gt;. Los datos utilizados en estos fallos no tendr&#237;an que ejecutarse con el rigor esperado de los datos contenidos en el data warehouse. En este caso, el fallo es su propio &#233;xito; cada fallo es un paso hacia la respuesta correcta.&lt;/p&gt;
&lt;p&gt;La mayor parte de usuarios de negocio ver&#225;n de manera acertada el data warehouse como la fuente de acceso a los datos de la empresa. Sus informes, cuadros de mandos/scorecards y las solicitudes de autoservicio ad hoc ser&#225;n f&#225;cilmente respaldadas por el data warehouse. A los usuarios objetivo de la caja anal&#237;tica se les llama normalmente “cient&#237;ficos de datos&amp;quot;. Estos individuos son el peque&#241;o grupo de usuarios de negocio suficientemente inteligentes para identificar las fuentes potenciales de datos, crear su propia “sombra” de base de datos, y construir an&#225;lisis con objetivos especiales. A menudo estos individuos tienen que trabajar desconectados de la red. Ellos han elaborado y creado su propio entorno anal&#237;tico en hojas de c&#225;lculo, conjuntos locales de datos, bajo los data marts del escritorio o donde quiera que el trabajo necesite ser llevado a cabo. La caja anal&#237;tica reconoce que estos individuos tienen requerimientos reales. Les proporciona un entorno para trabajar en la red en un entorno dotado, respaldado, establecido, disponible, funcional y, de alguna manera, m&#225;s sutil y dirigido.&lt;/p&gt;
&lt;p&gt;Disponer de las habilidades necesarias “in house” es esencial para el &#233;xito de la caja anal&#237;tica. Los usuarios de la caja anal&#237;tica necesitan poder conectar con los datos con bastantes menos reglas que la mayor&#237;a de los usuarios de negocio. Son usuarios capaces de auto-proporcionarse datos tanto si vienen del data warehouse como si no. Son capaces de construir las anal&#237;ticas y modelos directamente contra estos datos sin asistencia.&lt;/p&gt;
&lt;p&gt;La caja anal&#237;tica deber&#237;a estar poco dirigida. La idea es crear un entorno que vive sin la sobrecarga del entorno del data warehouse. No deber&#237;a ser usado para respaldar las capacidades de la misi&#243;n cr&#237;tica de la organizaci&#243;n. No deber&#237;a ser utilizada directamente para controlar o respaldar ninguna de las capacidades centrales operacionales. Igualmente, no est&#225; destinada a ser utilizada para informes continuos o anal&#237;ticas requeridas por los negocios de forma continua que respalden informes externos para cumplir las regulaciones financieras o gubernamentales.&lt;/p&gt;
&lt;p&gt;Una caracter&#237;stica importante de la caja anal&#237;tica es que es de naturaleza transitoria. Los datos y el an&#225;lisis vienen y van conforme son necesarios para respaldar los nuevos requerimientos anal&#237;ticos. Los datos no persisten y no son regularmente actualizados v&#237;a las capacidades ETL. Los datos en la caja anal&#237;tica normalmente tienen una fecha de expiraci&#243;n acordada. As&#237;, cualquiera de los nuevos hallazgos o capacidades identificados como importantes para la organizaci&#243;n y vitales para respaldar las continuas capacidades necesitar&#225;n ser incorporadas en las operaciones de la empresa o en los entornos del data warehouse.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2014/tipos-tablas-de-hecho.html</guid>
      <link>https://datawarehouse.es/2014/tipos-tablas-de-hecho.html</link>
      <title>Consejo de dise&#241;o #167 Tipos de tablas de hechos complementarias</title>
      <pubDate>Mon, 10 Apr 2017 00:06:51 GMT</pubDate>
      <atom:updated>2017-04-10T00:06:51Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/2014-tipos-tablas-de-hecho.jpg&quot; /&gt;
	  &lt;p&gt;Hay tres tipos fundamentales de tablas de hechos en el &#225;rea de presentaci&#243;n del data warehouse:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href=&quot;http://www.kimballgroup.com/data-warehouse-business-intelligence-resources/kimball-techniques/dimensional-modeling-techniques/transaction-fact-table/&quot;&gt;Tablas de hechos de transacciones&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;http://www.kimballgroup.com/data-warehouse-business-intelligence-resources/kimball-techniques/dimensional-modeling-techniques/periodic-snapshot-fact-table/&quot;&gt;Tablas de hechos de capturas peri&#243;dicas&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;http://www.kimballgroup.com/data-warehouse-business-intelligence-resources/kimball-techniques/dimensional-modeling-techniques/accumulating-snapshot-fact-table/&quot;&gt;Tablas de hechos de capturas acumuladas&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;La mayor&#237;a de equipos de dise&#241;o DW/BI est&#225;n muy familiarizados con las &lt;strong&gt;tablas de hechos de transacciones&lt;/strong&gt;. Son el tipo m&#225;s com&#250;n de tipos de tablas de hecho y normalmente el caballo de batalla para muchas organizaciones. Muchos equipos tambi&#233;n han incorporado las &lt;strong&gt;tablas de hechos de capturas peri&#243;dicas&lt;/strong&gt; en sus &#225;reas de presentaci&#243;n. Pocas organizaciones aprovechan las &lt;strong&gt;tablas de hechos de capturas acumuladas&lt;/strong&gt;. Los equipos de dise&#241;o normalmente no aprecian como una tabla de hechos de captura acumulada puede complementar tablas de hechos de capturas de transacciones y/o peri&#243;dicas.&lt;/p&gt;
&lt;p&gt;Cada tipo de tabla de hechos es una respuesta de dise&#241;o a la amplia variedad de requisitos planteados por la comunidad de negocio. A menudo la mejor respuesta de dise&#241;o es una combinaci&#243;n de dos, o incluso de tres, tipos de tabla de hechos. Las tablas de hechos m&#250;ltiples complementan unas a las otras, cada una apoya una &#250;nica visi&#243;n de los procesos de negocio los cuales ser&#237;a dif&#237;cil conseguir con s&#243;lo un tipo de tabla de hechos.&lt;/p&gt;
&lt;h3&gt;Un ejemplo&lt;/h3&gt;
&lt;p&gt;Una cadena de suministro log&#237;stica es un escenario excelente para ilustrar los tres tipos de tablas de hecho trabajando a la vez para dar soporte a un rico conjunto de requisitos empresariales. Utilizaremos una vista simplificada de los productos terminados de la cadena log&#237;stica de un gran fabricante de coches como ayuda para entender las fortalezas y el uso apropiado de cada tabla de hechos.&lt;/p&gt;
&lt;p&gt;Nuestro fabricante de coches tiene plantas donde los veh&#237;culos se ensamblan. Los veh&#237;culos terminados son llevados finalmente a los distribuidores donde se vender&#225;n a los usuarios finales. Nuestro fabricante ficticio mantiene el inventario de productos acabados en un gran aparcamiento -un verdadero almac&#233;n- situado justo a las puertas de la planta de ensamblaje. Los veh&#237;culos (del inventario) se env&#237;an desde el almac&#233;n de productos acabados mediante tren de carga a uno de los varios aparcamientos de la regi&#243;n. Desde estos almacenes regionales, el inventario se env&#237;a mediante cami&#243;n de carga a la localizaci&#243;n del distribuidor. Una vez que el veh&#237;culo llega al distribuidor, se prepara y se pone en el lote del distribuidor (inventario del almac&#233;n) para la venta final.&lt;/p&gt;
&lt;p&gt;Los usuarios del negocio log&#237;stico necesitan entender el n&#250;mero de veh&#237;culos que fluyen fuera del final de la cadena de ensamblaje, dentro y fuera de cada almac&#233;n, y el cliente final demanda varios tipos de veh&#237;culos, colores, modelos  y as&#237; sucesivamente. La compa&#241;&#237;a tambi&#233;n necesita entender y analizar el nivel de inventario en cada etapa de la cadena log&#237;stica. La gesti&#243;n de log&#237;stica quiere comprender cuanto tiempo lleva mover un veh&#237;culo desde la planta de ensamblaje hasta el cliente final, dependiendo del tipo de veh&#237;culo, almacenes y transportes. Mover los veh&#237;culos m&#225;s r&#225;pidamente y de forma eficiente a trav&#233;s de la cadena log&#237;stica ayuda a la compa&#241;&#237;a a minimizar los niveles de inventario y reducir los costes de transporte.&lt;/p&gt;
&lt;p&gt;Un dise&#241;o robusto para respaldar la cadena log&#237;stica de productos terminados de nuestro fabricante ilustra los tres tipos de tablas de hechos.&lt;/p&gt;
&lt;h4&gt;Tabla de hechos de transacciones&lt;/h4&gt;
&lt;p&gt;Un componente clave de la cadena log&#237;stica es la fluidez del inventario desde una localizaci&#243;n a otra. El flujo de veh&#237;culos se captura en una serie de inventarios de movimientos de transacciones. El veh&#237;culo es entonces enviado mediante tren al almac&#233;n regional donde se recibe para su inventario; m&#225;s tarde se mueve desde el inventario y se env&#237;a mediante cami&#243;n al distribuidor donde este lo recibe en su inventario. Para cada uno de estos movimientos de inventario, se genera un movimiento de inventario o una transacci&#243;n de env&#237;o/recepci&#243;n. El granulo de esta tabla de hechos es una fila para cada transacci&#243;n de  movimiento de inventario de cada veh&#237;culo. Del mismo modo la venta final del veh&#237;culo deber&#237;a ser capturada en una tabla de hechos de  transacci&#243;n de ventas con una fila para cada veh&#237;culo vendido.&lt;/p&gt;
&lt;p&gt;Las tablas de hechos transaccionales son una respuesta de dise&#241;o apropiada para los requerimientos del negocio que buscan entender la intensidad o cantidad del proceso de un negocio. Las tablas de hechos transaccionales ayudan a responder la pregunta &#191;cu&#225;ntos?. Por ejemplo &#191;cu&#225;ntos veh&#237;culos deportivos blancos (SUVs) se vendieron la semana pasada? &#191;Cu&#225;ntas fueron las vendas en d&#243;lares? &#191;Cu&#225;ntos veh&#237;culos de tracci&#243;n total se lanzaron para ensamblarse en inventario comercial? &#191;Cu&#225;ntos veh&#237;culos enviamos con un transportista pactado? &#191;Cu&#225;ntos veh&#237;culos han recibido nuestros distribuidores este mes? &#191;Y comparado con el &#250;ltimo mes, el &#250;ltimo trimestre, o el &#250;ltimo a&#241;o?  Hay una raz&#243;n por la cual las tablas de datos transaccionales son el caballo de batalla de los tipos de tablas de hechos: Soportan importanteS requerimientos cr&#237;ticos del negocio. Por otra parte, las tablas de hechos transaccionales son menos efectivas respondiendo preguntas sobre el estado de los niveles nuestro inventario o la rapidez/eficiencia de la cadena log&#237;stica. Para dar apoyo a estos requerimientos del negocio, buscamos otras tablas de hechos para complementar las tablas de hechos.&lt;/p&gt;
&lt;h4&gt;Tablas de hechos de capturas peri&#243;dicas&lt;/h4&gt;
&lt;p&gt;El segundo requisito es conocer la cantidad total de inventario en cualquier punto de la cadena. El apoyo del an&#225;lisis del nivel de inventario es una tarea adecuada para una tabla de hechos de captura peri&#243;dica. En cualquier momento del tiempo, cada veh&#237;culo est&#225; en una sola localizaci&#243;n f&#237;sica como por ejemplo el inventario de productos terminados en la planta, en un centro de distribuci&#243;n regional, en el parking de un distribuidor, o en tr&#225;nsito en un tren o cami&#243;n. Para apoyar el an&#225;lisis de inventario, la tabla de hechos de captura peri&#243;dica tiene un gr&#225;nulo de una fila por veh&#237;culo por d&#237;a. Una dimensi&#243;n de localizaci&#243;n soportar&#225; el an&#225;lisis de inventario en cada punto de la cadena.&lt;/p&gt;
&lt;p&gt;La tabla de hechos de captura peri&#243;dica hace un excelente trabajo ayudando a comprender el volumen de veh&#237;culos en nuestra cadena. Contesta a la pregunta &#191;cu&#225;nto? .&#191;Cu&#225;nto inventario tenemos? &#191;Cu&#225;nto inventario de veh&#237;culos blancos hay disponible? &#191;SUVs? &#191;cuatro puertas? &#191;modelos deportivos? &#191;en California? &#191;en los lotes de distribuidor? &#191;Comparados a meses anteriores, trimestres o a&#241;os?&lt;/p&gt;
&lt;p&gt;La captura peri&#243;dica respalda la tendencia de niveles de inventario a lo largo del tiempo. Las tablas de transacciones de movimiento y las capturas peri&#243;dicas de inventario juntas dan soporte a una amplia gama de requerimientos de negocio alrededor de la cadena log&#237;stica. Sin embargo, incluso con dos de estas tablas de hechos, ser&#225; dif&#237;cil atender los requisitos de eficiencia de la cadena. Para completar la fotograf&#237;a, una tabla de hechos de captura acumulada complementar&#225; la tabla de hechos transaccional y de captura peri&#243;dica.&lt;/p&gt;
&lt;h4&gt;Tabla de hechos de captura acumulada&lt;/h4&gt;
&lt;p&gt;El tercer conjunto de requisitos para la cadena log&#237;stica es soportar la velocidad de an&#225;lisis a la que los veh&#237;culos viajan en la cadena log&#237;stica. Cada veh&#237;culo recorrer&#225; una serie de etapas durante su viaje al cliente final. Para cumplir los requisitos anal&#237;ticos de medir y entender las eficiencias de nuestra cadena log&#237;stica, una tabla de hechos de captura acumulada se llenar&#225; con una fila por veh&#237;culo. A medida que cada veh&#237;culo se mueve por la cadena, la captura acumulada se actualizar&#225; con la fecha de cada movimiento y la localizaci&#243;n actual del veh&#237;culo. La captura acumulada tendr&#225; numerosas fechas clave, como por ejemplo fecha de entrega por ensamblaje, fecha de env&#237;o al centro de distribuci&#243;n, fecha de llegada al centro de distribuci&#243;n y as&#237; hasta la venta final. Las m&#233;tricas de tablas de hechos incluir&#225;n una serie de retrasos en las fechas que miden el tiempo que cuesta mover un veh&#237;culo entre las diferentes etapas de la cadena.&lt;/p&gt;
&lt;p&gt;La tabla de datos de captura acumulada respalda las principales medidas de eficiencia de velocidad. &#191;Con que rapidez se mueven los veh&#237;culos a trav&#233;s de la cadena? &#191;Cu&#225;l es la media de tiempo desde la salida de montaje hasta el consumidor final? &#191;Es diferente para los coches que para los SUVs? &#191;H&#237;bridos versus No-h&#237;bridos? &#191;Coches blancos versus coches rojos? &#191;Cu&#225;les son los transportistas/v&#237;as m&#225;s efectivos? Las capturas acumuladas  se actualizar&#225;n diariamente para los veh&#237;culos que se encuentren actualmente en la cadena log&#237;stica.&lt;/p&gt;
&lt;p&gt;Consecuentemente, la captura acumulada tambi&#233;n se usa para comprobar el estado actual de la cadena e identificar veh&#237;culos atascados, como por ejemplo encontrar todos los veh&#237;culos que han estado en un centro regional de distribuci&#243;n o en un distribuidor durante m&#225;s de “x” d&#237;as. &#191;Cu&#225;ntos veh&#237;culos han estado en tr&#225;nsito v&#237;a tren o cami&#243;n durante m&#225;s de “x” d&#237;as? &#191;D&#243;nde est&#225;n todos los SUVs? Esta tabla de hechos puede ayudar al equipo log&#237;stico a identificar y mover los veh&#237;culos de mayor demanda, identificar las oportunidades de mejora, e identificar los socios de transporte preferidos.&lt;/p&gt;
&lt;h3&gt;Conclusi&#243;n&lt;/h3&gt;
&lt;p&gt;En el caso de nuestro fabricante de coches, est&#225; claro que los tres tipos de tabla de hechos se complementan. Implementar las tres tablas de hechos es una respuesta apropiada al rico conjunto de requisitos empresariales. Implementar solo una o incluso solo dos de los tipos de tablas de hechos hubiesen hecho muy dif&#237;cil, si no imposible, respaldar todos los requerimientos.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/kimball-sobre-analisis-predictivo.html</guid>
      <link>https://datawarehouse.es/2015/kimball-sobre-analisis-predictivo.html</link>
      <title>Consejo de dise&#241;o #172: Aprovecha tu modelo dimensional para an&#225;lisis predictivo</title>
      <pubDate>Fri, 24 Mar 2017 01:33:09 GMT</pubDate>
      <atom:updated>2017-03-24T01:33:09Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/2015-kimball-sobre-analisis-predictivo.jpg&quot; /&gt;
	  &lt;p&gt;An&#225;lisis predictivo es el nombre que recibe una amplia gama de t&#233;cnicas usadas para hacer predicciones sobre comportamientos futuros. Calificaci&#243;n de cr&#233;dito, an&#225;lisis de riesgo, y selecci&#243;n de promoci&#243;n est&#225;n entre las muchas  aplicaciones que han probado ser &#250;tiles para generar ingresos y beneficios. Vale la pena echar un vistazo a la secci&#243;n “&lt;a href=&quot;https://en.wikipedia.org/wiki/Predictive_analytics&quot;&gt;an&#225;lisis predictivo&lt;/a&gt;” de la Wikipedia para apreciar el amplio alcance de estas t&#233;cnicas.&lt;/p&gt;
&lt;p&gt;A pesar de las diferencias significantes entre las t&#233;cnicas de an&#225;lisis predictivo, casi todas pueden tomar los datos como series de “observaciones” normalmente codificadas por una clave del data warehouse conocida como &amp;quot;cliente&amp;quot;. Con motivo de la discusi&#243;n asumiremos que tenemos 10 millones de clientes y esperamos predecir el comportamiento futuro poniendo en marcha una serie de aplicaciones anal&#237;ticas predictivas sobre las historias de estos clientes.&lt;/p&gt;
&lt;p&gt;Los datos de entrada deseados para la aplicaci&#243;n del an&#225;lisis predictivo es una tabla de 10 millones de filas cuya clave primaria es la clave duradera y &#250;nica del cliente, y cuyas columnas son un n&#250;mero abierto de atributos descriptivos, incluyendo los campos descriptivos usuales y los campos demogr&#225;ficos,* pero tambi&#233;n incluyendo indicadores, saldos y cantidades preparadas a prop&#243;sito para la puesta en marcha de la aplicaci&#243;n de an&#225;lisis predictivo*. Es este requisito en cursiva el que hace que esto sea tan interesante.&lt;/p&gt;
&lt;p&gt;Nuestros datos de entrada al modelo de an&#225;lisis predictivo parecen una tabla muy amplia, pero es mucho m&#225;s vol&#225;til y compleja que una tabla de dimensiones bastante estable. Algunos de los atributos ya existen en la dimensi&#243;n normal de cliente, pero muchos de los atributos interesantes se eligen en el momento del an&#225;lisis buscando en las tablas de hechos describiendo la historia de los clientes y despu&#233;s resumiendo esa historia en una etiqueta, puntuaci&#243;n o cantidad. Algunas aplicaciones de an&#225;lisis predictivo pueden querer actualizar los datos de entrada en tiempo real, y el analista puede desear a&#241;adir de manera din&#225;mica nuevos atributos calculados para los datos de entrada en cualquier momento.&lt;/p&gt;
&lt;p&gt;Finalmente, una instant&#225;nea dada de estos datos de entrada puede ser una dimensi&#243;n de cliente &#250;til por propio derecho.&lt;/p&gt;
&lt;p&gt;Si estas etiquetas de cliente, puntuaciones y cantidades son estables y se usan regularmente para filtrar consultas y agrupar m&#225;s all&#225; del an&#225;lisis predictivo, entonces pueden llegar formar parte de la dimensi&#243;n del consumidor de manera permanente. Dos patrones espec&#237;ficos de dise&#241;o (&lt;a href=&quot;http://www.kimballgroup.com/data-warehouse-business-intelligence-resources/kimball-techniques/dimensional-modeling-techniques/aggregated-fact-attribute/&quot;&gt;&amp;quot;hechos agregados como atributos dimensoinales&amp;quot;&lt;/a&gt; y la  &lt;a href=&quot;http://www.kimballgroup.com/data-warehouse-business-intelligence-resources/kimball-techniques/dimensional-modeling-techniques/behavior-tag-series-attribute/&quot;&gt;&amp;quot;etiqueta de comportamiento en un periodo&amp;quot;&lt;/a&gt;), se describen brevemente en el glosario de nuestra web y se ilustran en el &lt;a href=&quot;https://datawarehouse.es/ralph-kimball-books.html&quot;&gt;cap&#237;tulo 8 de la tercera edici&#243;n de “The Data Warehouse Toolkit”&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;Los datos de observaci&#243;n que alimentan una aplicaci&#243;n de an&#225;lisis predictivo de  un modelo dimensional es muy simple. Pero &#191;c&#243;mo llenamos la tabla? &#191;Se hace con el ETL mediante una compleja aplicaci&#243;n backroom que escribe esta tabla final en un formato convencional? &#191;Se hace completamente con SQL en el momento de ejecuci&#243;n donde cada campo de cada columna se rellena con un comando SELECT  correlacionado accediendo a tablas de hechos remotas? &#191;Pueden los datos de los atributos de observaci&#243;n ser almacenados en una dimensi&#243;n actual, antes que en tablas de hecho separadas, donde los m&#250;ltiples valores se almacenan como una array, incluso como series de tiempo? &#191;Hay herramientas de los entornos Hadoop como Spark o HBase que proporcionan un modo m&#225;s natural y eficiente de construir el conjunto de datos de observaci&#243;n entregado para el an&#225;lisis predictivo?&lt;/p&gt;
&lt;p&gt;Parte de mi papel en este a&#241;o de jubilaci&#243;n del Kimball Group es describir la relevancia duradera de nuestro bien-probado modelo de t&#233;cnicas dimensionales, y al mismo tiempo desafiaros a vosotros, lectores de la comunidad data warehouse, a pensar sobre las nuevas direcciones del data warehousing en el futuro. Para ser honesto, no tengo todas las respuestas a las preguntas mencionadas anteriormente, pero entre ahora y el final del a&#241;o describir&#233; al menos los desaf&#237;os y mi pensamiento de estos enfoques lo mejor que pueda.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/desatascar-la-cargas-hechos-claves-subrogadas.html</guid>
      <link>https://datawarehouse.es/2015/desatascar-la-cargas-hechos-claves-subrogadas.html</link>
      <title>Consejo de dise&#241;o #171: Desatascar la cadena de claves en la carga de las tabla de hechos</title>
      <pubDate>Wed, 15 Feb 2017 00:25:24 GMT</pubDate>
      <atom:updated>2017-02-15T00:25:24Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/2015-desatacagar-la-cargas-hechos.jpg&quot; /&gt;
	  &lt;p&gt;Definimos el sistema ETL como una actividad “back room” que los usuarios nunca ver&#225;n o tocar&#225;n. De todas maneras, el sistema ETL debe dise&#241;arse seg&#250;n los requisitos del usuario. En este &amp;quot;consejo de dise&#241;o&amp;quot; miramos el dise&#241;o de una pieza de la ETL desde la perspectiva de las necesidades del usuario de negocio.&lt;/p&gt;
&lt;p&gt;La &lt;strong&gt;cadena de clave subrogada&lt;/strong&gt; es la 14 de 34 sistemas ETL descritos por Ralph Kimball en &lt;a href=&quot;https://datawarehouse.es/ralph-kimball-books.html&quot;&gt;la tercera edici&#243;n del The Data Warehouse Toolkit&lt;/a&gt;. Hay una &lt;a href=&quot;http://www.kimballgroup.com/data-warehouse-business-intelligence-resources/kimball-techniques/etl-architecture-34-subsystems/&quot;&gt;rese&#241;a de los subsistemas ETL en nuestra web&lt;/a&gt;, junto con un &lt;a href=&quot;http://www.kimballgroup.com/2007/10/subsystems-of-etl-revisited/&quot;&gt;art&#237;culo&lt;/a&gt; de Bob Becker. La cadena de clave subrogada es normalmente el &#250;ltimo paso del procesamiento de la tabla de hechos donde el sistema ETL intercambia claves del sistema fuente por claves subrogadas del data warehouse.&lt;/p&gt;
&lt;p&gt;Para la mayor parte, la implementaci&#243;n de la cadena es un detalle dejado para el equipo ETL. Ellos decidir&#225;n si cargar los datos de hechos primero y si usar un widget de herramienta ETL, b&#250;squedas o  combinaciones de bases de datos para hacer la tarea de intercambiar claves de sistema fuente por las claves subrogadas del DWH. en cualquier caso, sin embargo, el equipo de dise&#241;o ETL necesita informaci&#243;n de la comunidad de usuarios de negocio sobre c&#243;mo manejar las filas problem&#225;ticas descritas en los escenarios siguientes.&lt;/p&gt;
&lt;h3&gt;Falta de la clave del sistema fuente&lt;/h3&gt;
&lt;p&gt;La situaci&#243;n m&#225;s simple se da cuando una fila de hechos de entrada pierde por completo una clave para una de las dimensiones. A veces una dimensi&#243;n simplemente no se refiere a alguna de las filas de hecho. Por ejemplo, considera el escenario de una tabla de hechos que describe la venta de productos en las tiendas. Este modelo dimensional debe incluir una dimensi&#243;n de promoci&#243;n que describa las promociones de marketing y cupones asociados con la venta de un art&#237;culo. Pero muchas ventas no est&#225;n asociadas con ninguna promoci&#243;n: el c&#243;digo de promoci&#243;n del sistema fuente est&#225; en blanco o nulo.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Es absolutamente imperativo que cada fila de la tabla de hechos tenga una fila correspondiente en cada tabla dimensional.&lt;/strong&gt; Ser&#237;a un error manejar este problema de falta de clave insertando una fila de hechos con una clave de promoci&#243;n nula. Una clave for&#225;nea nula en la tabla de hechos violar&#237;a autom&#225;ticamente la integridad referencial, y ninguna soluci&#243;n que implique OUTER JOINS tendr&#237;a sentido para el negocio.&lt;/p&gt;
&lt;p&gt;El problema de una clave ausente en el sistema de origen tiene una soluci&#243;n simple: poner una fila espec&#237;fica en la tabla dimensional para tratar esta circunstancia. Es com&#250;n utilizar una clave subrogada de -1, y despu&#233;s rellenar las otras columnas de dimensiones con una descripci&#243;n adecuada (ausente, desconocido, no disponible o no informado). Aseg&#250;rate de preguntar a los usuarios de negocio como quieren que se vean los atributos visibles en las filas de dimensiones ausentes.&lt;/p&gt;
&lt;h3&gt;Mala fuente de clave de sistema&lt;/h3&gt;
&lt;p&gt;Un problema de dise&#241;o m&#225;s importante es manejar una clave de sistema de entrada que el data warehouse no ha visto nunca antes. Las dimensiones deber&#237;an ser procesadas antes que los datos. De esta manera, bajo circunstancias normales, deber&#237;a haber una fila en cada tabla de dimensiones para cada clave en una fila de hechos. Pero el proceso ETL debe contar con lo inesperado. Hemos visto muchas soluciones, ninguna de ellas es perfecta.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&lt;em&gt;Opci&#243;n 1: Elimina la fila de hechos ausente.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Hay pocos escenarios en los cu&#225;les tendr&#237;a sentido para los usuarios de negocio que el sistema eliminara filas de hechos entrantes. Eliminando las filas se distorsionar&#237;an los totales y recuentos, y podr&#237;a existir contenido valioso en la fila.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&lt;em&gt;Opci&#243;n 2: Registra la fila de hechos negativos con una tabla de error.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Probablemente, esta es la soluci&#243;n m&#225;s com&#250;n. Es f&#225;cil de implementar y mantiene limpias la tabla de hecho y las tablas de dimensiones. Sin embargo, si tu sistema ETL simplemente escribe las filas de hechos problem&#225;ticas en una tabla de error y nunca son revisadas, el resultado es funcionalmente equivalente a eliminar la fila de hechos. El dise&#241;o correcto del sistema debe incluir dos procesos:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Un proceso automatizado que revisa las filas con errores para ver si la dimensi&#243;n ha aparecido y ya puede asignarse una clave subrogada.&lt;/li&gt;
&lt;li&gt;Un proceso manual mediante el cual una persona eval&#250;a los errores antiguos y se comunica con los sistemas operacionales para solucionarlos en origen.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;La mayor desventaja de este dise&#241;o es que los datos de hechos  no entran en la tabla de hechos. Esto estar&#237;a bien en algunos escenarios, pero ser&#237;a muy problem&#225;tico en otros casos (por ejemplo, en temas financieros, que necesitan cuadrar cifras).&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&lt;em&gt;Opci&#243;n 3: Asigna todas las filas de errores a una fila de dimensiones&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Esta soluci&#243;n es muy similar a la sugerencia de manejar un sistema de clave fuente ausente: todas las filas de hechos problem&#225;ticas se asignan a una &#250;nica fila de dimensiones (llam&#233;mosla fila -2). Como el valor ausente, esta dimensi&#243;n de fila desconocida tiene valores por defecto reconocible para todos los atributos, clarificando el prop&#243;sito de la fila.&lt;/p&gt;
&lt;p&gt;Hay dos ventajas para este enfoque:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Es extremadamente simple de implementar.&lt;/li&gt;
&lt;li&gt;Devuelve la fila de hechos err&#243;nea a la tabla de hechos. En informes, los hechos err&#243;neos se muestran asociados a la dimensi&#243;n desconocida.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Sin embargo, hay dos problemas significantes en este enfoque: 1) diversas filas de hechos err&#243;neos se agrupar&#225;n en una &#250;nica s&#250;per fila que no tendr&#225; sentido empresarial; y 2) es dif&#237;cil corregir los datos si ma&#241;ana el ETL recibe los detalles correctos de la dimensi&#243;n. Si es posible recibir posteriormente la informaci&#243;n sobre la dimensi&#243;n, los usuarios de negocio querr&#225;n que el ETL corrija la fila de hechos err&#243;nea para se&#241;alar la dimensi&#243;n correcta.&lt;/p&gt;
&lt;p&gt;Si los usuarios de negocio quieren que las filas de hechos sean re-enlazadas, necesitar&#225;s localizar el identificador de la dimensi&#243;n del sistema fuente en alg&#250;n sitio. Puedes:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Poner los identificadores del sistema origen en la tabla de hechos. Esta estrategia a&#241;adir&#225; una amplitud significativa a la tabla de hechos y por lo tanto degradar&#225;n el rendimiento en la consulta.&lt;/li&gt;
&lt;li&gt;Poner una clave primaria subrogada en la tabla de hechos, y registrar la condici&#243;n de error en una tabla separada que contenga al mismo tiempo  los identificadores del sistema fuente y la tabla de hechos de la clave primaria. Utiliza la tabla de hechos de la clave primaria para encontrar las filas de hechos a actualizar cuando descubras una dimensi&#243;n que ha llegado m&#225;s tarde.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;En cualquier caso, necesitar&#225;s emitir una sentencia UPDATE contra las filas de hecho apropiadas, re-situ&#225;ndolas desde -2 a la nueva clave de dimensi&#243;n correcta. El  principal argumento a favor de este enfoque era su simplicidad de implementaci&#243;n, pero si necesitas corregir los datos de hechos, este enfoque no es simple.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&lt;em&gt;Opci&#243;n 4: Crea una fila en la tabla de dimensi&#243;n (t&#233;cnica recomendada)&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;La soluci&#243;n final al problema de una mala clave del sistema fuente es crear un &amp;quot;hueco&amp;quot; en la dimensi&#243;n para acomodar el miembro misterioso. Si el ETL encuentra una mala clave del sistema fuente durante el procesado de la tabla de hechos, deber&#225; parar, recorrer la tabla dimensional, crear una fila, obtener su clave subrogada, y devolver esa clave a la tabla de hechos de clave subrogada.&lt;/p&gt;
&lt;p&gt;Los atributos de estas filas ser&#225;n similares a los atributos de filas ausentes o desconocidas, pero no son exactamente lo mismo. Sabemos un dato sobre estos atributos: El c&#243;digo en el sistema origen.&lt;/p&gt;
&lt;p&gt;Con esta t&#233;cnica, el sistema ETL est&#225; en una posici&#243;n ventajosa para arreglar el problema cuando recibe informaci&#243;n de este miembro dimensional. El procesamiento normal de la dimensi&#243;n actualizar&#225; los valores &amp;quot;desconocidos&amp;quot; a sus valores verdaderos y conocidos. La tabla de hecho no requerir&#225; ning&#250;n tratamiento especial porque los hechos ya estar&#225;n correctamente asignados a la clave subrogada adecuada.&lt;/p&gt;
&lt;p&gt;Esta t&#233;cnica es arriesgada si existe un ratio elevado de ruido-se&#241;al. Si hay muchas filas de hechos problem&#225;ticas, se crear&#225;n muchos registros de dimensi&#243;n dudosos, pero solo unos pocos se corregir&#225;n en futuras cargas. Esta es una de las razones por las que en sistemas ETL en tiempo real (donde datos sucios llegan cada pocos minutos o segundos), los datos en tiempo real son a menudo sustituidos por un lote de carga convencional al final del d&#237;a (el cual tendr&#225; mejor calidad, incluyendo el detalle completo de la transacci&#243;n).&lt;/p&gt;
&lt;h3&gt;Implicaciones de los requisitos empresariales&lt;/h3&gt;
&lt;p&gt;Tus decisiones de dise&#241;o sobre qu&#233; t&#233;cnica utilizar para manejar filas de hechos problem&#225;ticas deben estar dirigidas por las siguientes necesidades de los usuarios de negocio:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&#191;Quieren los usuarios de negocio que las filas de hecho negativas est&#233;n en la tabla de hechos para cuadrar las cifras? en caso negativo, redirige las filas con problemas hacia una tabla de error. Aseg&#250;rate que construyes procesos para sacarlos del apuro.&lt;/li&gt;
&lt;li&gt;&#191;Quieren los usuarios de negocio tratar las filas de hecho con correcciones de dimensiones que hayan llegado tarde? Si no, una posible soluci&#243;n es enlazar todos los hechos negativos al miembro desconocido (-2).&lt;/li&gt;
&lt;li&gt;Si los usuarios de negocio quieren los hechos problem&#225;ticos en la tabla de hechos, y ellos quieren actualizar las dimensiones tan pronto como llegue mejor informaci&#243;n, entonces el enfoque del &amp;quot;placeholder&amp;quot; es la apuesta mejor.&lt;/li&gt;
&lt;li&gt;En todos los casos, alguien de la comunidad de usuarios de negocio debe intervenir sobre c&#243;mo tratar los errores y las filas falsas. Tambi&#233;n debe considerarse la ordenaci&#243;n de la dimensi&#243;n (normalmente los usuarios de negocio quieren ver estas filas falsas en la parte superior de cualquier lista).&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Este ejemplo sobre la &amp;quot;cadena de la clave subrogada&amp;quot; es una muestra de como el mejor dise&#241;o del sistema ETL sigue el mantra Kimball: &lt;strong&gt;It’s all about the business.&lt;/strong&gt;&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/claves-metodo-kimball.html</guid>
      <link>https://datawarehouse.es/2015/claves-metodo-kimball.html</link>
      <title>Consejo de dise&#241;o #179: Principios clave del m&#233;todo Kimball</title>
      <pubDate>Fri, 06 Jan 2017 02:34:16 GMT</pubDate>
      <atom:updated>2017-01-06T02:34:16Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/&quot; /&gt;
	  &lt;p&gt;La mayor parte de la gu&#237;a del m&#233;todo Kimball para el dise&#241;o, desarrollo e  implementaci&#243;n de un sistema DW/BI es simplemente eso: una gu&#237;a. Existen cientos o miles de reglas en los numerosos libros de Kimball Group y confieso haber quebrantado muchas de esas reglas durante d&#233;cadas, cuando afrontaba objetivos conflictivos o realidades pol&#237;ticas desagradables.&lt;/p&gt;
&lt;p&gt;Me apasionan varios principios del m&#233;todo Kimball. En este consejo de dise&#241;o enumero las cosas que repito una y otra vez, tanto a las audiencias experimentadas como a las nuevas. Cualquier lector que haya asistido a una de mis clases, o me haya contratado como consultor, habr&#225; o&#237;do mi discurso sobre la mayor&#237;a o todos los puntos de esta lista.&lt;/p&gt;
&lt;h3&gt;1. El modelo dimensional es el activo clave.&lt;/h3&gt;
&lt;p&gt;El m&#233;todo Kimball, tal y como se explica en la segunda edici&#243;n de The Data Warehouse Lifecycle Toolkit, se centra en el modelo dimensional. Los principios del modelado dimensional representan las contribuciones m&#225;s conocidas de Ralph Kimball y Kimball Group, en el mundo de la inteligencia de negocios. Es nuestro foco ya que un buen modelado dimensional es absolutamente vital para el &#233;xito de tu proyecto DW/BI. Si obtienes el modelo correcto, y lo completas con integridad, el resto ser&#225; sencillo.&lt;/p&gt;
&lt;h3&gt;2. El modelado dimensional es una actividad de grupo.&lt;/h3&gt;
&lt;p&gt;Incluso el mejor modelador dimensional crear&#225; un modelo dimensional pobre si trabaja solo. El modelado dimensional no es solamente una actividad en grupo, es una actividad en grupo que debe involucrar a la comunidad de usuarios de negocio. A lo largo de los a&#241;os, hemos rechazado incontables solicitudes de consultor&#237;a para dise&#241;ar modelos sin aportaci&#243;n empresarial. O, peor, hemos luchado en proyectos costosos donde no se materializ&#243; la participaci&#243;n de los usuarios de negocio prometida.&lt;/p&gt;
&lt;p&gt;Pedimos un esfuerzo importante a los usuarios, sin duda. Nuestro proceso de dise&#241;o requiere normalmente 50-60 horas en sesiones repartidas en un per&#237;odo de entre 4 a 6 semanas (o m&#225;s, dependiendo de la complejidad). La gente que queremos que participe en las sesiones de dise&#241;o son siempre valiosa y exigente. Pero si no los podemos convencer para que dediquen el tiempo y la energ&#237;a necesarios, el sistema resultante fallar&#225;.&lt;/p&gt;
&lt;h3&gt;3. El modelo dimensional es la mejor concreci&#243;n para el sistema de DW / BI.&lt;/h3&gt;
&lt;p&gt;La mayor&#237;a de clientes con los que trabajo no tienen una concreci&#243;n escrita para el sistema DW/BI, ciertamente no tienen ning&#250;n documento  que refleje la realidad de manera significativa. El modelo de especificaci&#243;n m&#225;s com&#250;n incluye listas confusas de lo que los usuarios quieren filtrar y desglosar, as&#237; como la petici&#243;n de que los 2.000 informes existentes sean mantenidos en el nuevo sistema. Si todo lo que hemos conseguido con nuestro nuevo sistema DW/BI es resituar los  informes enlatados existentes, hemos fallado.&lt;/p&gt;
&lt;p&gt;Al final del proceso de dise&#241;o les pedimos a los usuarios de negocio que piensen sobre los an&#225;lisis que han hecho recientemente, que han intentado hacer, o que nos gustar&#237;a que hubiesen hecho, de la informaci&#243;n a partir del dise&#241;o actual. Queremos que nos digan &lt;em&gt;“S&#237;, el modelo propuesto satisface nuestras necesidades”&lt;/em&gt;. Al mismo tiempo, a la gente IT del equipo que ha estado supervisando las fuentes de datos, las transformaciones u otros detalles t&#233;cnicos, nos gusta que puedan afirmar &lt;em&gt;“Si, podemos llenar este modelo de datos”&lt;/em&gt;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;La redacci&#243;n del dise&#241;o del modelo dimensional es una especificaci&#243;n significativa y factible de los requisitos.&lt;/strong&gt;&lt;/p&gt;
&lt;h3&gt;4. El modelo dimensional debe a&#241;adir valor m&#225;s all&#225; de la reestructuraci&#243;n.&lt;/h3&gt;
&lt;p&gt;Algunas de las mejoras m&#225;s valiosas que puedes implementar en tu sistema DW/BI son a&#241;adir descriptores mejorados y grupos de datos usados frecuentemente. Normalmente, estas posibilidades se olvidan por parte del equipo de dise&#241;o. Incluso he encontrado equipos con una pol&#237;tica expl&#237;cita de no a&#241;adir nada m&#225;s all&#225; de lo que est&#225; en el sistema fuente.&lt;/p&gt;
&lt;p&gt;Ejemplos de incorporaciones valiosas al modelo de datos que incluyen:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Permitir que los usuarios puedan filtrar c&#243;digos de transacci&#243;n que se usan pocas veces.&lt;/li&gt;
&lt;li&gt;Proporcionar columnas de clasificaci&#243;n para listas de selecci&#243;n e informes que sean atractivas.&lt;/li&gt;
&lt;li&gt;Bandas pre-calculadas, como rangos de edad o medidas de calidad para las transacciones.&lt;/li&gt;
&lt;li&gt;Dar soporte a diferentes jerarqu&#237;as, o m&#225;s profundas, de las que son administradas en los sistemas de origen, como marketing frente a las visiones de fabricaci&#243;n de la dimensi&#243;n del producto.&lt;/li&gt;
&lt;/ul&gt;
&lt;h3&gt;5. Los sistemas de gesti&#243;n de datos maestros son una gran fuente.&lt;/h3&gt;
&lt;p&gt;La de-duplicaci&#243;n es una de las tareas m&#225;s dif&#237;ciles a las que se enfrenta el equipo de data warehouse. Desde los inicios del data warehousing, el equipo de mantenimiento ha luchado para dise&#241;ar los procesos ETL que deduplicaran entidades como la dimensi&#243;n &amp;quot;cliente&amp;quot;. La popularidad creciente y la funcionalidad de la tecnolog&#237;a y programas del master data management (MDM) proporcionan una mejor soluci&#243;n que el flujo ETL. &#161;Y no solo porque es duro!. El ritmo del proceso ETL,  donde queremos que la base en funcionamiento sea a prueba de balas, es  un inconveniente con el proceso de deduplicaci&#243;n.&lt;/p&gt;
&lt;p&gt;No importa lo buenas que sean nuestras herramientas, como de inteligente sea nuestro c&#243;digo, como de completas sean nuestras reglas de negocio, el proceso automatizado de deduplicaci&#243;n no puede alcanzar el 100% de precisi&#243;n. Se requiere una persona para juzgar los casos cuestionables. Funciona mucho mejor si esto es una responsabilidad profesional durante los d&#237;as laborables, m&#225;s que esperar a la carga del ETL.&lt;/p&gt;
&lt;p&gt;Un simple sistema MDM se puede utilizar para construir datos con valor a&#241;adido. Las dimensiones jer&#225;rquicas son mejores cuando son estructuradas desde los escritorios de los usuarios. Las herramientas MDM proporcionan una plataforma simple para gestionar esta informaci&#243;n.&lt;/p&gt;
&lt;h3&gt;6. Que no se excluya el data warehouse relacional.&lt;/h3&gt;
&lt;p&gt;Dise&#241;ar y llenar el data warehouse conformado de una empresa es duro. A todo el mundo le gustar&#237;a saltarse este paso. A lo largo de los m&#225;s de 23 a&#241;os de carrera en data warehousing, he observado  numerosos intentos para simplificar el proceso, desde construir la capa BI directamente desde el sistema de transacciones, hasta los llamados data warehouses virtuales, volviendo al ciclo actual de scripts de creaci&#243;n de  herramientas de visualizaci&#243;n.&lt;/p&gt;
&lt;p&gt;Como coment&#233; en el &lt;a href=&quot;http://www.kimballgroup.com/2014/01/design-tip-162-leverage-data-visualization-tools-but-avoid-anarchy/&quot;&gt;Consejo de dise&#241;o #162&lt;/a&gt;, aprovecha las herramientas de visualizaci&#243;n de datos, pero evita la anarqu&#237;a. A menos que controles completamente todos tus datos de origen, debes dejar el ETL para la herramienta ETL, dejar el almacenamiento de datos y la gesti&#243;n a un motor de database relacional, y dejar que las herramientas BI sean brillantes en lo que mejor hacen: grandes visualizaciones y experiencia de usuario.&lt;/p&gt;
&lt;h3&gt;7. Todo se trata del negocio.&lt;/h3&gt;
&lt;p&gt;Digo esto muchas veces durante mis clases y consultas. Es la caracter&#237;stica m&#225;s importante del m&#233;todo Kimball Lifecycle: Mant&#233;n el foco incuestionablemente en el negocio. Afecta a todo lo que hacemos y es el mensaje m&#225;s importante que transmitir hacia el futuro.&lt;/p&gt;
&lt;h2&gt;Mirando al futuro&lt;/h2&gt;
&lt;p&gt;Me siento incre&#237;blemente afortunada de haber formado parte del Kimball Group durante los &#250;ltimos 12 a&#241;os. Ha sido un honor trabajar no solo con Ralph, Margy, Bob y Warren, sino tambi&#233;n con los cientos de estudiantes, clientes y colegas con los que he aprendido tanto.  Me honra lo que hemos conseguido juntos, y me siento bendecida por lo que considero el mejor trabajo del mundo.&lt;/p&gt;
&lt;p&gt;Me siento particularmente afortunada en comparaci&#243;n con Warren, que falleci&#243; el a&#241;o pasado de c&#225;ncer cerebral y su muerte me afect&#243; profundamente tanto a m&#237; como al toda la gente del Kimball Group. En 2016, homenajear&#233; a Warren y su pasi&#243;n por el fitness haciendo ciclismo por todo Estados Unidos para recaudar fondos para la investigaci&#243;n del c&#225;ncer cerebral. Me honrar&#225; si sigues nuestro blog que narrar&#225; este viaje (&lt;a href=&quot;https://itinerantphilosopher.org/&quot;&gt;https://itinerantphilosopher.org/&lt;/a&gt;) y me emocionar&#233; si consideras hacer una donaci&#243;n por nuestros esfuerzos para recaudar fondos de investigaci&#243;n para el c&#225;ncer cerebral.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/conceptos-probados-y-ciertos-datawarehouse-businessintelligence.html</guid>
      <link>https://datawarehouse.es/2015/conceptos-probados-y-ciertos-datawarehouse-businessintelligence.html</link>
      <title>Consejo de dise&#241;o #178: Conceptos probados y ciertos para el &#233;xito del DW-BI</title>
      <pubDate>Fri, 06 Jan 2017 02:15:23 GMT</pubDate>
      <atom:updated>2017-01-06T02:15:23Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/&quot; /&gt;
	  &lt;p&gt;El tiempo pasa y pronto llegar&#225; la jubilaci&#243;n colectiva del Kimball Group. A finales de 2015 nos jubilaremos. En mi &#250;ltimo &amp;quot;Consejo de dise&#241;o&amp;quot; me gustar&#237;a compartir la perspectiva para el &#233;xito del DW/BI que he alcanzado durante mis 26 a&#241;os en el negocio del data warehouse/business intelligence.&lt;/p&gt;
&lt;p&gt;Mientras que el data warehousing existe desde hace mucho, contin&#250;an habiendo oportunidades importantes de aprovechar la informaci&#243;n para una toma de decisiones m&#225;s efectiva. Constantemente surgen nuevas tecnolog&#237;as que crean y nos permiten recopilar cada vez m&#225;s datos granulados del mundo que nos rodea. Los datos y las anal&#237;ticas que los rodean son tan interesantes e importantes como siempre – quiz&#225;s incluso m&#225;s. Nuevas y mejoradas soluciones DW/BI continuar&#225;n para ser implementadas. No habr&#225; futuro con carencia de oportunidades para aplicar las lecciones aprendidas sobre c&#243;mo crear un entorno DW/BI de &#233;xito.&lt;/p&gt;
&lt;p&gt;Reconocemos que el data warehousing es una industria que ha madurado. Hemos pasado la etapa embrionaria de la evoluci&#243;n del DW/BI. Estamos trabajando con hardware probado y capacitado y con tecnolog&#237;as de software nuevas y m&#225;s potentes que evolucionan continuamente. Como industria, hemos estado implementando data warehouses y sistemas de Business Intelligence durante mucho tiempo (d&#233;cadas, de hecho). Hemos aprendido lecciones, mejorado tecnolog&#237;as, perfilado t&#233;cnicas y madurado metodolog&#237;as. Numerosos individuos han sido entrenados, bautizados con el fuego de la experiencia, y han demostrado ser capaces de construir soluciones DW/BI de &#233;xito. Claramente, siempre habr&#225; novatos que entrenar, de los que ser mentores y a los que haya que profesionalizar. Sin embargo, como industria, sabemos lo que cuesta tener &#233;xito. No hay excusas para fallar.&lt;/p&gt;
&lt;p&gt;Mi recomendaci&#243;n para el &#233;xito &lt;strong&gt;continuado&lt;/strong&gt; es mantener tus ojos bien abiertos y centrarse constantemente en lo b&#225;sico. Abraza estos conceptos probados y ciertos que a&#241;os de experiencia han revelado como certeros:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;C&#233;ntrate en el negocio y sus necesidades:&lt;/strong&gt; Nunca olvides mantener un foco  de atenci&#243;n en adquirir valor empresarial. El &#233;xito de una iniciativa DW/BI depende totalmente del compromiso del usuario de negocio; manteniendo involucrados a los usuarios de negocio y conociendo sus necesidades se incrementa dr&#225;sticamente la probabilidad de &#233;xito. De hecho, la asegura.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Obt&#233;n patrocinio fuerte de la alta direcci&#243;n:&lt;/strong&gt; la falta de apoyo organizacional compromete el &#233;xito de la iniciativa DW/BI. La alta direcci&#243;n debe aceptar, apoyar, dirigir y financiar estos esfuerzos como programas a largo plazo.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Organ&#237;zate para el &#233;xito:&lt;/strong&gt; Las iniciativas DW/BI de &#233;xito son emprendidas como una asociaci&#243;n entre el equipo IT y las unidades de negocio. El esfuerzo para llevar a cabo el DW/BI no se puede identificar solo como un esfuerzo de IT. La comunidad de negocio (no IT) necesita tomar posesi&#243;n de la visi&#243;n, la estrategia, la hoja de ruta (prioridades), alcance, los plazos, el gobierno y la calidad del entorno del DW/BI.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;La integraci&#243;n es cr&#237;tica:&lt;/strong&gt; Aprovechar las dimensiones conformadas como la base de integraci&#243;n. Entiende y abraza la disciplina del dise&#241;o dimensional como el tema de organizaci&#243;n de los datos dentro del entorno DW/BI.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Establece y aplica vocabulario com&#250;n:&lt;/strong&gt; El primer paso para eliminar los problemas de  inconsistencia en los datos es establecer y aplicar nombres comunes, definiciones y descripciones en todo el entorno DW/BI. De nuevo, abrazar la disciplina del modelado dimensional es el secreto de la victoria.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;C&#233;ntrate en la calidad de los datos:&lt;/strong&gt; En su creaci&#243;n, el entorno DW/BI debe ser un repositorio de datos de alta calidad. Los desaf&#237;os m&#225;s grandes para la mayor&#237;a de iniciativas DW/BI est&#225;n relacionados con los datos. En general, la iniciativa de desarrollar el proceso ETL requerido para proporcionar datos de alta calidad es normalmente m&#225;s exigente de lo que se esperaba. Tiempo y recursos adecuados, incluyendo a expertos en materias clave, deben ser asignados a estas tareas.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Establece un dise&#241;o escalonado, desarrollo y un plan de implementaci&#243;n:&lt;/strong&gt; Construir un entorno DW/BI es un esfuerzo significativo. Es casi imposible abordar todo al mismo tiempo.  Adopta un plan de desarrollo iterativo que evite  un alcance excesivamente ambicioso. Las iteraciones del proyecto necesitan ser identificadas para incorporar el dise&#241;o general, desarrollo e implementaci&#243;n. El entorno debe crecer abordando nuevos y adicionales procesos empresariales (p.e.; tablas de hechos).&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Muestra paciencia:&lt;/strong&gt; La fase inicial de una iniciativa DW/BI normalmente requiere un periodo desproporcionadamente largo; yo le llamo “el gran trago”. Esto es necesariamente cierto. Mientras que la fase inicial corresponde a implementar un solo proceso empresarial, la mayor parte del tiempo en esta fase se dedica a dise&#241;ar, desarrollar e implementar el conjunto b&#225;sico cr&#237;tico de dimensiones conformadas que ser&#225;n potenciadas en todo el entorno DW/BI en fases posteriores. Esto es normal y debe ser esperado.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Finalmente, como nota personal, me gustar&#237;a agradecer a mis clientes, estudiantes, compa&#241;eros, familia y amigos su apoyo durante estos a&#241;os. He aprendido m&#225;s de todos vosotros de lo que nunca apreciar&#233;is. Cada uno de vosotros tiene mi m&#225;s profunda gratitud.&lt;/p&gt;
&lt;p&gt;&#161;Gracias y Buena suerte!&lt;/p&gt;
&lt;p&gt;Bob&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/design-tip-177-colaboracion.html</guid>
      <link>https://datawarehouse.es/2015/design-tip-177-colaboracion.html</link>
      <title>Consejo de dise&#241;o  #177: La colaboraci&#243;n entre negocio e  IT</title>
      <pubDate>Fri, 06 Jan 2017 00:58:16 GMT</pubDate>
      <atom:updated>2017-01-06T00:58:16Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/&quot; /&gt;
	  &lt;p&gt;En el &#250;ltimo &amp;quot;consejo de dise&#241;o&amp;quot;, vuelvo a un tema fundamental que no es ninguna cosa compleja pero es ignorada con demasiada frecuencia: &lt;strong&gt;La colaboraci&#243;n entre negocio e  IT&lt;/strong&gt;. Si aceptas la proposici&#243;n de que la verdadera medida del &#233;xito del DW/BI es el uso del sistema por parte del usuario negocio, entonces aceptar la importancia de la colaboraci&#243;n deber&#237;a ser f&#225;cil. Lograr la aceptaci&#243;n empresarial es una utop&#237;a si el equipo de IT no colabora con su contraparte empresarial. Del mismo modo, Negocio necesita estar deseando colaborar con el IT.&lt;/p&gt;
&lt;p&gt;Los equipos colaborativos multidisciplinares crean sistemas DW/BI de &#233;xito. Cada cuesti&#243;n importante del enfoque &amp;quot;Kimball Lifecycle&amp;quot; se presta a actividades conjuntas que refuerzan la alineaci&#243;n negocios-IT:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Planificaci&#243;n del proyecto:&lt;/strong&gt; Marca prioridades basadas en metas y objetivos empresariales, proponiendo unos entregables realistas.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Direcci&#243;n del proyecto:&lt;/strong&gt; Comunicar abiertamente sobre la situaci&#243;n del proyecto y solicitar &amp;quot;feedback&amp;quot; para definir modificaciones en el alcance de manera consensuada.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Requerimientos empresariales:&lt;/strong&gt; Incidir en lo que hace el negocio y por qu&#233;, y en como la empresa espera tomar las decisiones en el futuro, en lugar de preguntar “&#191;qu&#233; quieres en un sistema DW/BI?”&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Arquitectura t&#233;cnica y selecci&#243;n de productos:&lt;/strong&gt; Involucra a los representantes de la empresa para seleccionar sus herramientas. Como un recordatorio amistoso a los ingenieros: la tecnolog&#237;a es un habilitador previo, &#161;pero no debe ser el foco de atenci&#243;n primario del equipo DW/BI! No te molestes en educar (o tal vez educar en exceso) al negocio sobre infraestructura y tuber&#237;as.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Modelado dimensional:&lt;/strong&gt; Derivar modelos dimensionales de talleres interactivos con negocio y representantes IT en lugar de dejarlo en manos de un dise&#241;ador solitario sentado en una torre de  marfil. Contratar a expertos en la materia del negocio es absolutamente necesario para dise&#241;ar modelos dimensionales apropiados. Deben estar incluidos en el descubrimiento de datos y en las decisiones asociadas al gobierno de los datos.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;El dise&#241;o y desarrollo del ETL:&lt;/strong&gt; Hacer una lista de expertos en la materia empresarial para enlazar adecuadamente los problemas en la calidad de datos con representante IT. IT no debe tomar estas decisiones en solitario.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Dise&#241;o y desarrollo de la aplicaci&#243;n BI:&lt;/strong&gt; El prototipo BI se crea y analiza con el negocio.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Implementaci&#243;n:&lt;/strong&gt; Solicita aportaci&#243;n empresarial sobre las necesidades iniciales y continuas de educaci&#243;n y apoyo.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Puesto que muchos suscriptores a este sitio pertenecen al departamento de IT, me he centrado en la importancia de que IT rompa barreras con el negocio. De esta manera, ver&#225;n a sus colegas como colaboradores en lugar de como cuellos de botella. Pero la colaboraci&#243;n se debe dar en los dos sentidos. Es igual de importante que los representantes de negocio colaboren con su contraparte IT considerando la siguiente gu&#237;a:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Invita a IT a sentarse contigo durante las sesiones de estrategia.&lt;/li&gt;
&lt;li&gt;Invierte tiempo en educar a IT acerca del negocio. Cuanto m&#225;s sepa IT, mejor te podr&#225;n apoyar tus necesidades. Es insuficiente e inefectivo proporcionar a IT simplemente un informe con las especificaciones del conjunto de datos.&lt;/li&gt;
&lt;li&gt;Contrata IT en el principio de la iniciativa en lugar de esperar a la mitad del proyecto (o despu&#233;s de que tus consultores se hayan ido).&lt;/li&gt;
&lt;li&gt;Aprecia la necesidad de IT de pensar sobre la empresa, no solo en tu departamento individual. Sus preocupaciones referentes al gobierno de datos y los &amp;quot;metadatos&amp;quot; son reales.&lt;/li&gt;
&lt;li&gt;Esfu&#233;rzate en evitar la proliferaci&#243;n de conjuntos de datos, informes y an&#225;lisis similares, pero ligeramente diferentes. Esta proliferaci&#243;n normalmente termina en costes directos e indirectos significativos para la organizaci&#243;n.&lt;/li&gt;
&lt;li&gt;Aprovecha la experiencia IT. No tomes decisiones sobre la tecnolog&#237;a sin involucrarles. Y preg&#250;ntate a ti mismo si realmente quieres mantener los silos de datos y aplicaciones con proveedores sin la ayuda de IT.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;El enfoque Kimball disuade la mentalidad cliente-vendedor donde el negocio proporciona al IT una orden que este intenta realizar. Nuestro enfoque siempre defiende la asociaci&#243;n entre IT y las partes interesadas del negocio. La colaboraci&#243;n va m&#225;s all&#225; de programar una reuni&#243;n con las partes interesadas; colaborar significa trabajar diferente, involucrar a ambas partes en tomar decisiones.&lt;/p&gt;
&lt;p&gt;Desafortunadamente, la colaboraci&#243;n entre el negocio y IT no se da de manera natural en algunas organizaciones. La gente puede pensar diferente, comunicar usando diferente vocabulario y ser incentivada de manera diferente. La meta es involucrarse mutuamente y entender que se requiere un fuerte apoyo organizacional en los niveles de liderazgo, especialmente si negocio e IT necesitan ser empujados fuera de su zona de confort. La l&#237;nea que separa ambos campos se difuminar&#225; con personas que cabalgan c&#243;modamente entre ambos mundos.&lt;/p&gt;
&lt;h3&gt;Despedida&lt;/h3&gt;
&lt;p&gt;Finalmente, os comunico que esta es mi &#250;ltima oportunidad de hablar con todos vosotros. Quiero expresar mi gratitud y aprecio por las numerosas personas que se han cruzado en mi camino durante los &#250;ltimos 34 a&#241;os. Gracias a mi marido y a mi hija por vuestra paciencia inquebrantable y vuestro apoyo. Gracias a mis colegas de Metaphor cuya influencia ha persistido durante mi carrera. Gracias a mis socios de DecisionWorks y Kimball Group por vuestra inteligencia e inspiraci&#243;n. Y lo m&#225;s importante, gracias a mis clientes, estudiantes y lectores; &#161;hab&#233;is hecho que sea un viaje incre&#237;ble!&lt;/p&gt;
&lt;p&gt;Bajar la persiana siempre duro. Mientras el Kimball Group est&#225; cerrando sus puertas, nuestros m&#233;todos vivir&#225;n a trav&#233;s de vosotros.&lt;/p&gt;
&lt;p&gt;&#161;Buena suerte! Solo recordad: &#161;centraos en el negocio y sed dimensionales!&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/perfiles-peligrosos.html</guid>
      <link>https://datawarehouse.es/2015/perfiles-peligrosos.html</link>
      <title>Consejo de dise&#241;o #173: Los perfiles peligrosos son un peligro para el negocio</title>
      <pubDate>Tue, 27 Dec 2016 10:46:45 GMT</pubDate>
      <atom:updated>2016-12-27T10:46:45Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/2015-perfiles-peligrosos.jpg&quot; /&gt;
	  &lt;p&gt;A lo largo de los a&#241;os, hemos trabajado con incontables y ejemplares miembros de proyectos DW/BI: brillantes, expertos, dedicados y motivados, en comuni&#243;n con una dosis sana de confianza mutua, respeto y camarader&#237;a con sus compa&#241;eros de equipo. Equipos con miembros que poseen estas caracter&#237;sticas tienden a trabajar a m&#225;ximo rendimiento con un resultado global mejor que el obtenido por la suma de las partes.&lt;/p&gt;
&lt;p&gt;Pero tambi&#233;n hemos llevado a cabo proyectos con &amp;quot;personas de riesgo&amp;quot;; adem&#225;s de ser no-contribuyentes individuales, pueden minar la efectividad de todo el equipo DW/BI. Esperamos que tu equipo no incluya recursos que  padezcan las siguientes perfiles:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;contendientes obstruccionistas&amp;quot;&lt;/em&gt;&lt;/strong&gt; son opositores perpetuos que encuentran pegas a todo y obtienen mayor satisfacci&#243;n en el proceso de debate que en el proceso de decisi&#243;n.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;buscadores de novedades&amp;quot;&lt;/em&gt;&lt;/strong&gt;,  que siempre est&#225;n ansiosos de probar lo &#250;ltimo, los mejores gadgets y artilugios t&#233;cnicos sin importar si siguen los objetivos del proyecto DW/BI.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;cortadores de galletas&amp;quot;&lt;/em&gt;&lt;/strong&gt; (&lt;em&gt;cookie cutters&lt;/em&gt;), que contin&#250;an haciendo exactamente lo que se les mand&#243; en el pasado, sin tener en cuenta sus &#250;ltimos matices asignados.&lt;/li&gt;
&lt;li&gt;Las &lt;strong&gt;&lt;em&gt;&amp;quot;malas hierbas&amp;quot;&lt;/em&gt;&lt;/strong&gt; pierden de vista el bosque desde los &#225;rboles, se centran exclusivamente en los detalles menos importantes sin tener en cuenta la visi&#243;n global.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;estudiantes e investigadores perpetuos&amp;quot;&lt;/em&gt;&lt;/strong&gt; quieren leer y leer, y leer algo m&#225;s, pero tienen pocas ganas de pasar a la acci&#243;n porque siempre hay algo m&#225;s que aprender.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;esp&#237;ritus independientes&amp;quot;&lt;/em&gt;&lt;/strong&gt; marchan siguiendo su propio ritmo sin prestar atenci&#243;n a las reglas, est&#225;ndares y las mejores pr&#225;cticas aceptadas.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;educados oculta-problemas&amp;quot;&lt;/em&gt;&lt;/strong&gt;, que siempre asienten con un &amp;quot;s&#237;&amp;quot;  y dicen “no problem”, incluso cuando problemas serios aguardan en la esquina.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;incompetentes disfuncionales y jubilados mentales&amp;quot;&lt;/em&gt;&lt;/strong&gt; est&#225;n paralizados y son incapaces de actuar.&lt;/li&gt;
&lt;li&gt;Los que se &lt;em&gt;auto-declaran expertos sabelotodo&lt;/em&gt; no necesitan escuchar porque ya tienen todas las respuestas. &#161;Simplemente preg&#250;ntales!&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&amp;quot;&lt;em&gt;sobrepreocupados por las amenazas&amp;quot;&lt;/em&gt;&lt;/strong&gt; est&#225;n tan paralizados por el miedo a lo que pueda pasar que responden no haciendo nada.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Por supuesto, incluso con compa&#241;eros superestrella, un buen liderazgo para el grupo es necesario. Esperamos que tu director de proyecto DW/BI se ajuste a lo siguiente:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Establece una colaboraci&#243;n con el negocio, incluyendo tomar responsabilidad en la propiedad del proyecto DW/BI. De este modo, los l&#237;deres son respetados por la empresa por estar orientados hacia el usuario m&#225;s que hacia la tecnolog&#237;a.&lt;/li&gt;
&lt;li&gt;Demuestra excelentes aptitudes interpersonales y organizacionales, ya que el proyecto/programa DW/BI comprende una perspectiva pol&#237;tica y cultural.&lt;/li&gt;
&lt;li&gt;Recluta y retiene recursos con el talento requerido,  consigue que trabajen con cohesi&#243;n con un mismo libro de t&#225;cticas, y entiende que a&#241;adir jugadores mediocres no incrementa las oportunidades de ganar. Por otro lado, tambi&#233;n se&#241;ala a los individuos que retrasan el esfuerzo y los asesoran proactivamente (o al menos minimizan el riesgo de que el proyecto descarrile).&lt;/li&gt;
&lt;li&gt;Escucha con mucha atenci&#243;n,  adem&#225;s comunica de manera efectiva y honesta, estableciendo las expectativas adecuadas para decir “no” cuando sea necesario.&lt;/li&gt;
&lt;li&gt;Posee un dominio profesional &#243;ptimo del DW/BI, adem&#225;s de grandes habilidades de direcci&#243;n de proyecto. Como m&#237;nimo, se mantiene un cap&#237;tulo por delante del equipo de proyecto en &lt;a href=&quot;https://datawarehouse.es/ralph-kimball-books.html&quot;&gt;The Data Warehouse Lifecycle Toolkit&lt;/a&gt;…&lt;/li&gt;
&lt;li&gt;Entiende que el &#233;xito del DW/BI est&#225; directamente relacionado con el periodo de aceptaci&#243;n del negocio.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Los directores de proyectos inexpertos, inefectivos o indecisos que no muestren estas caracter&#237;sticas son igualmente recursos de riesgo para el proyecto.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2011/recomendaciones-testing-datawarehouse.html</guid>
      <link>https://datawarehouse.es/2011/recomendaciones-testing-datawarehouse.html</link>
      <title>Consejo de die&#241;o #134: Recomendaciones para las pruebas del Data Warehouse</title>
      <pubDate>Thu, 03 Nov 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-11-03T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/&quot; /&gt;
	  &lt;p&gt;La validaci&#243;n de un entorno datawarehouse/BI es un gran reto. La metodolog&#237;a de validaci&#243;n est&#225;ndar valida s&#243;lo una peque&#241;a cosa a la vez. Sin embargo, la naturaleza de un sistema DW/BI versa sobre integraciones complejas, sin mencionar el elevado volumen de datos. Aqu&#237; est&#225;n mis 5 recomendaciones principales para construir y ejecutar un test en el entorno de tu proyecto DW/BI.&lt;/p&gt;
&lt;h2&gt;1. Crea un peque&#241;o test est&#225;tico de la base de datos, derivado de los datos reales.&lt;/h2&gt;
&lt;p&gt;Necesitas que sea peque&#241;o para que el test se realice r&#225;pidamente. Necesitas que sea est&#225;tico para conocer de antemano los resultados esperados. Y necesitas que derive de datos reales porque no hay nada como los datos reales para ofrecer una combinaci&#243;n realista de escenarios buenos y malos. Necesitar&#225;s a&#241;adir filas en el test de la base de datos para probar que cada una de las instrucciones de tu c&#243;digo ETL cubre un escenario no incluido en el test de datos original.&lt;/p&gt;
&lt;h2&gt;2. Comprueba pronto y con regularidad.&lt;/h2&gt;
&lt;p&gt;Empieza comprobando tan pronto como escribas una l&#237;nea de c&#243;digo (o conectas dos cajas en el UI de tu herramienta ETL). Los desarrolladores hacen esto todo el tiempo, por supuesto. Desarrollar implica poner en marcha tests unitarios para asegurar que su c&#243;digo funciona como se espera. Muchos desarrolladores no son tan buenos siguiendo la evoluci&#243;n de esas pruebas y realiz&#225;ndolas frecuentemente. Diariamente. Cada vez que se realiza un commit en tu c&#243;digo. Si realizas el test cada d&#237;a, y priorizas en mejorar cada test que fall&#243; ayer, ser&#225; m&#225;s f&#225;cil determinar aquello que no funcion&#243;.&lt;/p&gt;
&lt;p&gt;La prueba unitaria asegura que el c&#243;digo desarrollado funciona tal y como se ha dise&#241;ado. La prueba del sistema asegura que el sistema en completo funciona, de acuerdo con las especificaciones. La prueba del sistema tambi&#233;n se deber&#237;a realizar pronto.&lt;/p&gt;
&lt;p&gt;Hay una &amp;quot;fase de test&amp;quot; oficial antes de la puesta en funcionamiento del DWH. Esta fase de tests es para llevar a cabo las pruebas y reconocer problemas, no para identificar como deber&#237;an ser los tests y como llevarlos a cabo. &lt;strong&gt;Se debe  empezar a probar el sistema al inicio del proceso de desarrollo&lt;/strong&gt;, de esta manera todos los detalles se resuelven mucho antes de empezar con la &amp;quot;fase de test&amp;quot; oficial, que supone mayor presi&#243;n para el funcionamiento correcto del sistema.&lt;/p&gt;
&lt;h2&gt;3. Utilizar herramientas de prueba y automatizar el entorno de prueba.&lt;/h2&gt;
&lt;p&gt;La recomendaci&#243;n de hacer el test pronto y regularmente es pr&#225;ctica solamente si automatizas el proceso. Ning&#250;n desarrollador va a utilizar hasta la &#250;ltima de su d&#237;a de trabajo haciendo de ni&#241;era de la prueba unitaria. Y pocos equipos pueden permitirse un controlador a tiempo completo para hacer ese trabajo en lugar del desarrollador. Para automatizar la prueba, necesitas herramientas. Muchas organizaciones ya disponen “in situ” de herramientas para comprobar la calidad de las pruebas. Si tu no las tienes, o est&#225;s convencido de que las herramientas de las que dispones no responden a las necesidades de control del sistema DW/BI, intenta buscar en google “herramientas de software para asegurar la calidad” para disponer de una inmensa lista de productos y metodolog&#237;as disponibles a una extensa gama de precios.&lt;/p&gt;
&lt;p&gt;Todos los software comerciales de herramientas de prueba te permitir&#225;n formular tests, ejecutar tests, registrar los resultados de los tests realizados y informar de esos resultados. Para la prueba de la unidad y prueba de la calidad de los datos, define los tests para llevar a cabo una consulta en la fuente y el objetivo del almac&#233;n de datos. &lt;strong&gt;Tienes que buscar el recuento de filas y cantidades para hacerlas coincidir.&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Una herramienta de testing utilizada para probar el DW/BI debe ser capaz de ejecutar un escenario que establezca el entorno de prueba antes de que las pruebas se lleven a cabo. Las tareas que necesitar&#225; ejecutar incluyen:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Restaurar un entorno de m&#225;quina virtual con un test de datos limpio.&lt;/li&gt;
&lt;li&gt;Modificar el test est&#225;tico de datos con filas especiales para probar condiciones inusuales.&lt;/li&gt;
&lt;li&gt;Ejecutar tu programa ETL&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Despu&#233;s de ejecutar y registrar los tests, termina con un &lt;em&gt;script&lt;/em&gt; de limpieza, que deber&#237;a ser tan simple como eliminar el entorno VM.&lt;/p&gt;
&lt;p&gt;La metodolog&#237;a de prueba est&#225;ndar cambia una cosa, ejecuta un test y registra los resultados. En el mundo del DW/BI, debes agrupar juntos muchos tests en un grupo de tests. Incluso con una base de datos peque&#241;a, no tienes que ejecutar tu c&#243;digo ETL para cada una de los centenares de unidades que deber&#237;an estar funcionando.&lt;/p&gt;
&lt;h2&gt;4. Haz una lista de los usuarios de negocios para definir los tests del sistema.&lt;/h2&gt;
&lt;p&gt;Necesitamos la experiencia de los usuarios para definir buenos tests para el sistema. &#191;C&#243;mo sabemos que los datos son correctos? &#191;C&#243;mo sabemos que el rendimiento de las consultas cumple sus expectativas? Hacer una lista de los usuarios de negocios durante el proceso de especifiaci&#243;n del test asegurar&#225; una mejor prueba que si simplemente el equipo DW/BI construye tests basados en lo que creen que es interesante. Contar con los usuarios de negocios clave en el proceso de aseguramiento de la calidad tambi&#233;n proporciona un impulso enorme en la credibilidad.&lt;/p&gt;
&lt;h2&gt;5. El test del entorno debe ser tan similar como sea posible al entorno de producci&#243;n.&lt;/h2&gt;
&lt;p&gt;Es de vital importancia que el entorno de test sea similar al de producci&#243;n. Ser&#237;a ideal que fuese el mismo hardware, software y configuraci&#243;n. En el mundo real, relativamente pocas organizaciones tienen presupuesto para tener dos servidores DW grandes. Pero cualquier organizaci&#243;n puede, y debe, hacer coincidir los siguientes elementos:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Configuraci&#243;n de la unidad (nombres relativos de las unidades). El disco es barato y debes ser capaz de duplicar tu disco para su test. Pero si no puedes, al menos haz que los escritos de la unidad y el archivo de la base de datos tengan la misma disposici&#243;n. Mucha gente se queja de que esto significa mucho trabajo para cambiar el entorno . &#161;Lo es! Y es mucho mejor hacerlo ahora que en la fase final del test de tu proyecto.&lt;/li&gt;
&lt;li&gt;Las versiones de software del sistema operativo de la base de datos con la base de datos de los escritorios de los usuarios, y todo aquello que los relacione.&lt;/li&gt;
&lt;li&gt;Dise&#241;o del servidor. Si el software de reporting est&#225; en su propio servidor de producci&#243;n, pru&#233;balo de esa manera.&lt;/li&gt;
&lt;li&gt;Roles de seguridad y privilegios para las cuentas de mantenimiento. Tu despliegue est&#225; virtualmente relegado al fracaso si no compruebas los roles de seguridad primero. No s&#233; porque, pero siempre parece que va a ir mal.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;strong&gt;Si sigues estas sugerencias, especialmente la sugerencia de probar continuamente, probablemente tengas una fase de test agradable y sin crisis y cumplir&#225;s el hito de pase a producci&#243;n en  la fecha programada.&lt;/strong&gt;  Si no, est&#225;s corriendo un serio riesgo de retrasar interminablemente un fabuloso proyecto en el infierno QA, con los usuarios de negocios y la direcci&#243;n llamando a tu puerta.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>


   
</channel>
</rss>
