<?xml version="1.0" encoding="utf-8"?>
 <rss xmlns:atom="http://www.w3.org/2005/Atom" version="2.0">
 <channel>
   <title>Datawarehouse f&#225;cil</title>
   <atom:link href="https://datawarehouse.es/rss.xml" rel="self" type="application/rss+xml" />
   <link>https://datawarehouse.es</link>
   <description></description>

 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/cajas-analiticas.html</guid>
      <link>https://datawarehouse.es/2015/cajas-analiticas.html</link>
      <title>Consejo de dise&#241;o #174: &#191;Tu organizaci&#243;n necesita una &#39;analytical sandbox&#39;?</title>
      <pubDate>Wed, 12 Apr 2017 01:54:00 GMT</pubDate>
      <atom:updated>2017-04-12T01:54:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/2015-cajas-analiticas.jpg&quot; /&gt;
	  &lt;p&gt;Innumerables organizaciones han creado data warehouses dimensionales y est&#225;n considerados como grandes &#233;xitos dentro de sus organizaciones. Estos entornos de data warehouse respaldan los informes clave y los requisitos de an&#225;lisis para la empresa. Muchos son capaces de dar apoyo al acceso autosuficiente a los datos y a las capacidades de an&#225;lisis para usuarios de negocio dispares.&lt;/p&gt;
&lt;p&gt;Sin embargo, pese al &#233;xito obtenido por estos data warehouses dimensionales, son a veces criticados por ser demasiado lentos en reaccionar a los nuevos requisitos, implementar nuevas fuentes de datos y respaldar las nuevas capacidades de an&#225;lisis. A veces estas preocupaciones son exageradas, ya que claramente se necesita un cierto per&#237;odo de tiempo para reaccionar a los nuevos requisitos, pero otras veces estas cr&#237;ticas son ciertas. Muchos data warehouses han crecido y evolucionado para llegar a ser entornos de misi&#243;n cr&#237;tica que respaldan los informes de empresa clave, cuadros de mando, scorecards y capacidades de  acceso autoservicio a los datos. Debido a la naturaleza de misi&#243;n cr&#237;tica, el modelado dimensional, la direcci&#243;n, el desarrollo de reglas ETL, y los cambios en los requisitos de gesti&#243;n desembocan en una aprobaci&#243;n larga, ciclos de dise&#241;o y desarrollo para los nuevos requisitos y cambios. En muchos sentidos, estos desaf&#237;os son el precio del &#233;xito.&lt;/p&gt;
&lt;p&gt;El data warehouse es probable que est&#233; muy estructurado, cuidadosamente dise&#241;ado, sujeto a reglas de negocio bien definidas, y estrechamente dirigido por la empresa. Gran parte de los datos del data warehouse se limpian y transforman de forma intensiva para asegurar que ofrecen una imagen fiel de lo que pasa actualmente en el negocio. Adem&#225;s, los datos del data warehouse se sincronizan frecuentemente con los entornos de producci&#243;n v&#237;a cargas programadas regularmente. De esta manera, al final, es bastante r&#237;gido; simplemente lleva tiempo reaccionar a los nuevos datos y las solicitudes anal&#237;ticas.&lt;/p&gt;
&lt;p&gt;En el mundo competitivo de hoy en d&#237;a, las organizaciones necesitan ser todav&#237;a m&#225;s &#225;giles. Quieren comprobar r&#225;pidamente las nuevas ideas, nuevas hip&#243;tesis, nuevas fuentes de datos y nuevas tecnolog&#237;as. La creaci&#243;n de una caja anal&#237;tica (data sandbox)  puede ser una respuesta apropiada a estos requerimientos. Una caja anal&#237;tica complementa el data warehouse dimensional. No se destina a reemplazar el data warehouse, sino que se mantiene a su lado y proporciona un entorno que puede reaccionar m&#225;s r&#225;pidamente a los nuevos requerimientos. La caja anal&#237;tica no es un concepto realmente nuevo, pero en los recientes debates sobre grandes datos han puesto el concepto de nuevo en vanguardia. &lt;strong&gt;Normalmente se considera que una caja anal&#237;tica es un &#225;rea situada fuera de la infraestructura existente en el data warehouse o como un entorno separado adyacente al data warehouse. Proporciona el entorno y los recursos requeridos para apoyar las capacidades anal&#237;ticas experimentales o de desarrollo.&lt;/strong&gt; Es un lugar donde estas nuevas ideas, hip&#243;tesis, fuentes de datos y herramientas pueden ser utilizadas, probadas, evaluadas y exploradas. Mientras tanto, el data warehouse se mantiene como el pre-requisito de la fundaci&#243;n de datos que contiene los datos hist&#243;ricos precisos que los esfuerzos de la caja anal&#237;tica hace girar alrededor y en contra.&lt;/p&gt;
&lt;p&gt;A veces, los datos del entorno de data warehouse existente alimentan la caja anal&#237;tica y se alinea con otros almacenes cuyos datos no est&#225;n a&#250;n en el DWH. Es un lugar donde las nuevas fuentes de datos pueden ser probadas para determinar su valor para la empresa. Un ejemplo de estas nuevas fuentes de datos puede ser la inteligencia de mercado adquirida externamente, atributos de los consumidores adquiridos externamente, o fuentes como interacciones en las redes sociales, interacciones con las aplicaciones m&#243;viles y la actividad web. A menudo ser&#237;a muy costoso traer estas nuevas fuentes de datos al entorno de data warehouse existente a menos que (o hasta que) se pruebe su validez. Los datos de la caja anal&#237;tica no necesitan estar sincronizados sobre una base recurrente con un entorno de producci&#243;n y estos conjuntos de datos expiran con el paso del tiempo.&lt;/p&gt;
&lt;p&gt;Un objetivo clave de la caja anal&#237;tica es comprobar cierta variedad de hip&#243;tesis sobre los datos y anal&#237;ticas. De esta manera, no deber&#237;a ser una gran sorpresa que la mayor&#237;a de proyectos de caja anal&#237;tica terminen en fracaso. Eso significa que la hip&#243;tesis no funciona como se esperaba. Esta es una de las grandes ventajas del &lt;em&gt;sandbox&lt;/em&gt;. Los datos utilizados en estos fallos no tendr&#237;an que ejecutarse con el rigor esperado de los datos contenidos en el data warehouse. En este caso, el fallo es su propio &#233;xito; cada fallo es un paso hacia la respuesta correcta.&lt;/p&gt;
&lt;p&gt;La mayor parte de usuarios de negocio ver&#225;n de manera acertada el data warehouse como la fuente de acceso a los datos de la empresa. Sus informes, cuadros de mandos/scorecards y las solicitudes de autoservicio ad hoc ser&#225;n f&#225;cilmente respaldadas por el data warehouse. A los usuarios objetivo de la caja anal&#237;tica se les llama normalmente “cient&#237;ficos de datos&amp;quot;. Estos individuos son el peque&#241;o grupo de usuarios de negocio suficientemente inteligentes para identificar las fuentes potenciales de datos, crear su propia “sombra” de base de datos, y construir an&#225;lisis con objetivos especiales. A menudo estos individuos tienen que trabajar desconectados de la red. Ellos han elaborado y creado su propio entorno anal&#237;tico en hojas de c&#225;lculo, conjuntos locales de datos, bajo los data marts del escritorio o donde quiera que el trabajo necesite ser llevado a cabo. La caja anal&#237;tica reconoce que estos individuos tienen requerimientos reales. Les proporciona un entorno para trabajar en la red en un entorno dotado, respaldado, establecido, disponible, funcional y, de alguna manera, m&#225;s sutil y dirigido.&lt;/p&gt;
&lt;p&gt;Disponer de las habilidades necesarias “in house” es esencial para el &#233;xito de la caja anal&#237;tica. Los usuarios de la caja anal&#237;tica necesitan poder conectar con los datos con bastantes menos reglas que la mayor&#237;a de los usuarios de negocio. Son usuarios capaces de auto-proporcionarse datos tanto si vienen del data warehouse como si no. Son capaces de construir las anal&#237;ticas y modelos directamente contra estos datos sin asistencia.&lt;/p&gt;
&lt;p&gt;La caja anal&#237;tica deber&#237;a estar poco dirigida. La idea es crear un entorno que vive sin la sobrecarga del entorno del data warehouse. No deber&#237;a ser usado para respaldar las capacidades de la misi&#243;n cr&#237;tica de la organizaci&#243;n. No deber&#237;a ser utilizada directamente para controlar o respaldar ninguna de las capacidades centrales operacionales. Igualmente, no est&#225; destinada a ser utilizada para informes continuos o anal&#237;ticas requeridas por los negocios de forma continua que respalden informes externos para cumplir las regulaciones financieras o gubernamentales.&lt;/p&gt;
&lt;p&gt;Una caracter&#237;stica importante de la caja anal&#237;tica es que es de naturaleza transitoria. Los datos y el an&#225;lisis vienen y van conforme son necesarios para respaldar los nuevos requerimientos anal&#237;ticos. Los datos no persisten y no son regularmente actualizados v&#237;a las capacidades ETL. Los datos en la caja anal&#237;tica normalmente tienen una fecha de expiraci&#243;n acordada. As&#237;, cualquiera de los nuevos hallazgos o capacidades identificados como importantes para la organizaci&#243;n y vitales para respaldar las continuas capacidades necesitar&#225;n ser incorporadas en las operaciones de la empresa o en los entornos del data warehouse.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2014/tipos-tablas-de-hecho.html</guid>
      <link>https://datawarehouse.es/2014/tipos-tablas-de-hecho.html</link>
      <title>Consejo de dise&#241;o #167 Tipos de tablas de hechos complementarias</title>
      <pubDate>Mon, 10 Apr 2017 00:06:51 GMT</pubDate>
      <atom:updated>2017-04-10T00:06:51Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/2014-tipos-tablas-de-hecho.jpg&quot; /&gt;
	  &lt;p&gt;Hay tres tipos fundamentales de tablas de hechos en el &#225;rea de presentaci&#243;n del data warehouse:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href=&quot;http://www.kimballgroup.com/data-warehouse-business-intelligence-resources/kimball-techniques/dimensional-modeling-techniques/transaction-fact-table/&quot;&gt;Tablas de hechos de transacciones&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;http://www.kimballgroup.com/data-warehouse-business-intelligence-resources/kimball-techniques/dimensional-modeling-techniques/periodic-snapshot-fact-table/&quot;&gt;Tablas de hechos de capturas peri&#243;dicas&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;http://www.kimballgroup.com/data-warehouse-business-intelligence-resources/kimball-techniques/dimensional-modeling-techniques/accumulating-snapshot-fact-table/&quot;&gt;Tablas de hechos de capturas acumuladas&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;La mayor&#237;a de equipos de dise&#241;o DW/BI est&#225;n muy familiarizados con las &lt;strong&gt;tablas de hechos de transacciones&lt;/strong&gt;. Son el tipo m&#225;s com&#250;n de tipos de tablas de hecho y normalmente el caballo de batalla para muchas organizaciones. Muchos equipos tambi&#233;n han incorporado las &lt;strong&gt;tablas de hechos de capturas peri&#243;dicas&lt;/strong&gt; en sus &#225;reas de presentaci&#243;n. Pocas organizaciones aprovechan las &lt;strong&gt;tablas de hechos de capturas acumuladas&lt;/strong&gt;. Los equipos de dise&#241;o normalmente no aprecian como una tabla de hechos de captura acumulada puede complementar tablas de hechos de capturas de transacciones y/o peri&#243;dicas.&lt;/p&gt;
&lt;p&gt;Cada tipo de tabla de hechos es una respuesta de dise&#241;o a la amplia variedad de requisitos planteados por la comunidad de negocio. A menudo la mejor respuesta de dise&#241;o es una combinaci&#243;n de dos, o incluso de tres, tipos de tabla de hechos. Las tablas de hechos m&#250;ltiples complementan unas a las otras, cada una apoya una &#250;nica visi&#243;n de los procesos de negocio los cuales ser&#237;a dif&#237;cil conseguir con s&#243;lo un tipo de tabla de hechos.&lt;/p&gt;
&lt;h3&gt;Un ejemplo&lt;/h3&gt;
&lt;p&gt;Una cadena de suministro log&#237;stica es un escenario excelente para ilustrar los tres tipos de tablas de hecho trabajando a la vez para dar soporte a un rico conjunto de requisitos empresariales. Utilizaremos una vista simplificada de los productos terminados de la cadena log&#237;stica de un gran fabricante de coches como ayuda para entender las fortalezas y el uso apropiado de cada tabla de hechos.&lt;/p&gt;
&lt;p&gt;Nuestro fabricante de coches tiene plantas donde los veh&#237;culos se ensamblan. Los veh&#237;culos terminados son llevados finalmente a los distribuidores donde se vender&#225;n a los usuarios finales. Nuestro fabricante ficticio mantiene el inventario de productos acabados en un gran aparcamiento -un verdadero almac&#233;n- situado justo a las puertas de la planta de ensamblaje. Los veh&#237;culos (del inventario) se env&#237;an desde el almac&#233;n de productos acabados mediante tren de carga a uno de los varios aparcamientos de la regi&#243;n. Desde estos almacenes regionales, el inventario se env&#237;a mediante cami&#243;n de carga a la localizaci&#243;n del distribuidor. Una vez que el veh&#237;culo llega al distribuidor, se prepara y se pone en el lote del distribuidor (inventario del almac&#233;n) para la venta final.&lt;/p&gt;
&lt;p&gt;Los usuarios del negocio log&#237;stico necesitan entender el n&#250;mero de veh&#237;culos que fluyen fuera del final de la cadena de ensamblaje, dentro y fuera de cada almac&#233;n, y el cliente final demanda varios tipos de veh&#237;culos, colores, modelos  y as&#237; sucesivamente. La compa&#241;&#237;a tambi&#233;n necesita entender y analizar el nivel de inventario en cada etapa de la cadena log&#237;stica. La gesti&#243;n de log&#237;stica quiere comprender cuanto tiempo lleva mover un veh&#237;culo desde la planta de ensamblaje hasta el cliente final, dependiendo del tipo de veh&#237;culo, almacenes y transportes. Mover los veh&#237;culos m&#225;s r&#225;pidamente y de forma eficiente a trav&#233;s de la cadena log&#237;stica ayuda a la compa&#241;&#237;a a minimizar los niveles de inventario y reducir los costes de transporte.&lt;/p&gt;
&lt;p&gt;Un dise&#241;o robusto para respaldar la cadena log&#237;stica de productos terminados de nuestro fabricante ilustra los tres tipos de tablas de hechos.&lt;/p&gt;
&lt;h4&gt;Tabla de hechos de transacciones&lt;/h4&gt;
&lt;p&gt;Un componente clave de la cadena log&#237;stica es la fluidez del inventario desde una localizaci&#243;n a otra. El flujo de veh&#237;culos se captura en una serie de inventarios de movimientos de transacciones. El veh&#237;culo es entonces enviado mediante tren al almac&#233;n regional donde se recibe para su inventario; m&#225;s tarde se mueve desde el inventario y se env&#237;a mediante cami&#243;n al distribuidor donde este lo recibe en su inventario. Para cada uno de estos movimientos de inventario, se genera un movimiento de inventario o una transacci&#243;n de env&#237;o/recepci&#243;n. El granulo de esta tabla de hechos es una fila para cada transacci&#243;n de  movimiento de inventario de cada veh&#237;culo. Del mismo modo la venta final del veh&#237;culo deber&#237;a ser capturada en una tabla de hechos de  transacci&#243;n de ventas con una fila para cada veh&#237;culo vendido.&lt;/p&gt;
&lt;p&gt;Las tablas de hechos transaccionales son una respuesta de dise&#241;o apropiada para los requerimientos del negocio que buscan entender la intensidad o cantidad del proceso de un negocio. Las tablas de hechos transaccionales ayudan a responder la pregunta &#191;cu&#225;ntos?. Por ejemplo &#191;cu&#225;ntos veh&#237;culos deportivos blancos (SUVs) se vendieron la semana pasada? &#191;Cu&#225;ntas fueron las vendas en d&#243;lares? &#191;Cu&#225;ntos veh&#237;culos de tracci&#243;n total se lanzaron para ensamblarse en inventario comercial? &#191;Cu&#225;ntos veh&#237;culos enviamos con un transportista pactado? &#191;Cu&#225;ntos veh&#237;culos han recibido nuestros distribuidores este mes? &#191;Y comparado con el &#250;ltimo mes, el &#250;ltimo trimestre, o el &#250;ltimo a&#241;o?  Hay una raz&#243;n por la cual las tablas de datos transaccionales son el caballo de batalla de los tipos de tablas de hechos: Soportan importanteS requerimientos cr&#237;ticos del negocio. Por otra parte, las tablas de hechos transaccionales son menos efectivas respondiendo preguntas sobre el estado de los niveles nuestro inventario o la rapidez/eficiencia de la cadena log&#237;stica. Para dar apoyo a estos requerimientos del negocio, buscamos otras tablas de hechos para complementar las tablas de hechos.&lt;/p&gt;
&lt;h4&gt;Tablas de hechos de capturas peri&#243;dicas&lt;/h4&gt;
&lt;p&gt;El segundo requisito es conocer la cantidad total de inventario en cualquier punto de la cadena. El apoyo del an&#225;lisis del nivel de inventario es una tarea adecuada para una tabla de hechos de captura peri&#243;dica. En cualquier momento del tiempo, cada veh&#237;culo est&#225; en una sola localizaci&#243;n f&#237;sica como por ejemplo el inventario de productos terminados en la planta, en un centro de distribuci&#243;n regional, en el parking de un distribuidor, o en tr&#225;nsito en un tren o cami&#243;n. Para apoyar el an&#225;lisis de inventario, la tabla de hechos de captura peri&#243;dica tiene un gr&#225;nulo de una fila por veh&#237;culo por d&#237;a. Una dimensi&#243;n de localizaci&#243;n soportar&#225; el an&#225;lisis de inventario en cada punto de la cadena.&lt;/p&gt;
&lt;p&gt;La tabla de hechos de captura peri&#243;dica hace un excelente trabajo ayudando a comprender el volumen de veh&#237;culos en nuestra cadena. Contesta a la pregunta &#191;cu&#225;nto? .&#191;Cu&#225;nto inventario tenemos? &#191;Cu&#225;nto inventario de veh&#237;culos blancos hay disponible? &#191;SUVs? &#191;cuatro puertas? &#191;modelos deportivos? &#191;en California? &#191;en los lotes de distribuidor? &#191;Comparados a meses anteriores, trimestres o a&#241;os?&lt;/p&gt;
&lt;p&gt;La captura peri&#243;dica respalda la tendencia de niveles de inventario a lo largo del tiempo. Las tablas de transacciones de movimiento y las capturas peri&#243;dicas de inventario juntas dan soporte a una amplia gama de requerimientos de negocio alrededor de la cadena log&#237;stica. Sin embargo, incluso con dos de estas tablas de hechos, ser&#225; dif&#237;cil atender los requisitos de eficiencia de la cadena. Para completar la fotograf&#237;a, una tabla de hechos de captura acumulada complementar&#225; la tabla de hechos transaccional y de captura peri&#243;dica.&lt;/p&gt;
&lt;h4&gt;Tabla de hechos de captura acumulada&lt;/h4&gt;
&lt;p&gt;El tercer conjunto de requisitos para la cadena log&#237;stica es soportar la velocidad de an&#225;lisis a la que los veh&#237;culos viajan en la cadena log&#237;stica. Cada veh&#237;culo recorrer&#225; una serie de etapas durante su viaje al cliente final. Para cumplir los requisitos anal&#237;ticos de medir y entender las eficiencias de nuestra cadena log&#237;stica, una tabla de hechos de captura acumulada se llenar&#225; con una fila por veh&#237;culo. A medida que cada veh&#237;culo se mueve por la cadena, la captura acumulada se actualizar&#225; con la fecha de cada movimiento y la localizaci&#243;n actual del veh&#237;culo. La captura acumulada tendr&#225; numerosas fechas clave, como por ejemplo fecha de entrega por ensamblaje, fecha de env&#237;o al centro de distribuci&#243;n, fecha de llegada al centro de distribuci&#243;n y as&#237; hasta la venta final. Las m&#233;tricas de tablas de hechos incluir&#225;n una serie de retrasos en las fechas que miden el tiempo que cuesta mover un veh&#237;culo entre las diferentes etapas de la cadena.&lt;/p&gt;
&lt;p&gt;La tabla de datos de captura acumulada respalda las principales medidas de eficiencia de velocidad. &#191;Con que rapidez se mueven los veh&#237;culos a trav&#233;s de la cadena? &#191;Cu&#225;l es la media de tiempo desde la salida de montaje hasta el consumidor final? &#191;Es diferente para los coches que para los SUVs? &#191;H&#237;bridos versus No-h&#237;bridos? &#191;Coches blancos versus coches rojos? &#191;Cu&#225;les son los transportistas/v&#237;as m&#225;s efectivos? Las capturas acumuladas  se actualizar&#225;n diariamente para los veh&#237;culos que se encuentren actualmente en la cadena log&#237;stica.&lt;/p&gt;
&lt;p&gt;Consecuentemente, la captura acumulada tambi&#233;n se usa para comprobar el estado actual de la cadena e identificar veh&#237;culos atascados, como por ejemplo encontrar todos los veh&#237;culos que han estado en un centro regional de distribuci&#243;n o en un distribuidor durante m&#225;s de “x” d&#237;as. &#191;Cu&#225;ntos veh&#237;culos han estado en tr&#225;nsito v&#237;a tren o cami&#243;n durante m&#225;s de “x” d&#237;as? &#191;D&#243;nde est&#225;n todos los SUVs? Esta tabla de hechos puede ayudar al equipo log&#237;stico a identificar y mover los veh&#237;culos de mayor demanda, identificar las oportunidades de mejora, e identificar los socios de transporte preferidos.&lt;/p&gt;
&lt;h3&gt;Conclusi&#243;n&lt;/h3&gt;
&lt;p&gt;En el caso de nuestro fabricante de coches, est&#225; claro que los tres tipos de tabla de hechos se complementan. Implementar las tres tablas de hechos es una respuesta apropiada al rico conjunto de requisitos empresariales. Implementar solo una o incluso solo dos de los tipos de tablas de hechos hubiesen hecho muy dif&#237;cil, si no imposible, respaldar todos los requerimientos.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/claves-metodo-kimball.html</guid>
      <link>https://datawarehouse.es/2015/claves-metodo-kimball.html</link>
      <title>Consejo de dise&#241;o #179: Principios clave del m&#233;todo Kimball</title>
      <pubDate>Fri, 06 Jan 2017 02:34:16 GMT</pubDate>
      <atom:updated>2017-01-06T02:34:16Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/&quot; /&gt;
	  &lt;p&gt;La mayor parte de la gu&#237;a del m&#233;todo Kimball para el dise&#241;o, desarrollo e  implementaci&#243;n de un sistema DW/BI es simplemente eso: una gu&#237;a. Existen cientos o miles de reglas en los numerosos libros de Kimball Group y confieso haber quebrantado muchas de esas reglas durante d&#233;cadas, cuando afrontaba objetivos conflictivos o realidades pol&#237;ticas desagradables.&lt;/p&gt;
&lt;p&gt;Me apasionan varios principios del m&#233;todo Kimball. En este consejo de dise&#241;o enumero las cosas que repito una y otra vez, tanto a las audiencias experimentadas como a las nuevas. Cualquier lector que haya asistido a una de mis clases, o me haya contratado como consultor, habr&#225; o&#237;do mi discurso sobre la mayor&#237;a o todos los puntos de esta lista.&lt;/p&gt;
&lt;h3&gt;1. El modelo dimensional es el activo clave.&lt;/h3&gt;
&lt;p&gt;El m&#233;todo Kimball, tal y como se explica en la segunda edici&#243;n de The Data Warehouse Lifecycle Toolkit, se centra en el modelo dimensional. Los principios del modelado dimensional representan las contribuciones m&#225;s conocidas de Ralph Kimball y Kimball Group, en el mundo de la inteligencia de negocios. Es nuestro foco ya que un buen modelado dimensional es absolutamente vital para el &#233;xito de tu proyecto DW/BI. Si obtienes el modelo correcto, y lo completas con integridad, el resto ser&#225; sencillo.&lt;/p&gt;
&lt;h3&gt;2. El modelado dimensional es una actividad de grupo.&lt;/h3&gt;
&lt;p&gt;Incluso el mejor modelador dimensional crear&#225; un modelo dimensional pobre si trabaja solo. El modelado dimensional no es solamente una actividad en grupo, es una actividad en grupo que debe involucrar a la comunidad de usuarios de negocio. A lo largo de los a&#241;os, hemos rechazado incontables solicitudes de consultor&#237;a para dise&#241;ar modelos sin aportaci&#243;n empresarial. O, peor, hemos luchado en proyectos costosos donde no se materializ&#243; la participaci&#243;n de los usuarios de negocio prometida.&lt;/p&gt;
&lt;p&gt;Pedimos un esfuerzo importante a los usuarios, sin duda. Nuestro proceso de dise&#241;o requiere normalmente 50-60 horas en sesiones repartidas en un per&#237;odo de entre 4 a 6 semanas (o m&#225;s, dependiendo de la complejidad). La gente que queremos que participe en las sesiones de dise&#241;o son siempre valiosa y exigente. Pero si no los podemos convencer para que dediquen el tiempo y la energ&#237;a necesarios, el sistema resultante fallar&#225;.&lt;/p&gt;
&lt;h3&gt;3. El modelo dimensional es la mejor concreci&#243;n para el sistema de DW / BI.&lt;/h3&gt;
&lt;p&gt;La mayor&#237;a de clientes con los que trabajo no tienen una concreci&#243;n escrita para el sistema DW/BI, ciertamente no tienen ning&#250;n documento  que refleje la realidad de manera significativa. El modelo de especificaci&#243;n m&#225;s com&#250;n incluye listas confusas de lo que los usuarios quieren filtrar y desglosar, as&#237; como la petici&#243;n de que los 2.000 informes existentes sean mantenidos en el nuevo sistema. Si todo lo que hemos conseguido con nuestro nuevo sistema DW/BI es resituar los  informes enlatados existentes, hemos fallado.&lt;/p&gt;
&lt;p&gt;Al final del proceso de dise&#241;o les pedimos a los usuarios de negocio que piensen sobre los an&#225;lisis que han hecho recientemente, que han intentado hacer, o que nos gustar&#237;a que hubiesen hecho, de la informaci&#243;n a partir del dise&#241;o actual. Queremos que nos digan &lt;em&gt;“S&#237;, el modelo propuesto satisface nuestras necesidades”&lt;/em&gt;. Al mismo tiempo, a la gente IT del equipo que ha estado supervisando las fuentes de datos, las transformaciones u otros detalles t&#233;cnicos, nos gusta que puedan afirmar &lt;em&gt;“Si, podemos llenar este modelo de datos”&lt;/em&gt;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;La redacci&#243;n del dise&#241;o del modelo dimensional es una especificaci&#243;n significativa y factible de los requisitos.&lt;/strong&gt;&lt;/p&gt;
&lt;h3&gt;4. El modelo dimensional debe a&#241;adir valor m&#225;s all&#225; de la reestructuraci&#243;n.&lt;/h3&gt;
&lt;p&gt;Algunas de las mejoras m&#225;s valiosas que puedes implementar en tu sistema DW/BI son a&#241;adir descriptores mejorados y grupos de datos usados frecuentemente. Normalmente, estas posibilidades se olvidan por parte del equipo de dise&#241;o. Incluso he encontrado equipos con una pol&#237;tica expl&#237;cita de no a&#241;adir nada m&#225;s all&#225; de lo que est&#225; en el sistema fuente.&lt;/p&gt;
&lt;p&gt;Ejemplos de incorporaciones valiosas al modelo de datos que incluyen:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Permitir que los usuarios puedan filtrar c&#243;digos de transacci&#243;n que se usan pocas veces.&lt;/li&gt;
&lt;li&gt;Proporcionar columnas de clasificaci&#243;n para listas de selecci&#243;n e informes que sean atractivas.&lt;/li&gt;
&lt;li&gt;Bandas pre-calculadas, como rangos de edad o medidas de calidad para las transacciones.&lt;/li&gt;
&lt;li&gt;Dar soporte a diferentes jerarqu&#237;as, o m&#225;s profundas, de las que son administradas en los sistemas de origen, como marketing frente a las visiones de fabricaci&#243;n de la dimensi&#243;n del producto.&lt;/li&gt;
&lt;/ul&gt;
&lt;h3&gt;5. Los sistemas de gesti&#243;n de datos maestros son una gran fuente.&lt;/h3&gt;
&lt;p&gt;La de-duplicaci&#243;n es una de las tareas m&#225;s dif&#237;ciles a las que se enfrenta el equipo de data warehouse. Desde los inicios del data warehousing, el equipo de mantenimiento ha luchado para dise&#241;ar los procesos ETL que deduplicaran entidades como la dimensi&#243;n &amp;quot;cliente&amp;quot;. La popularidad creciente y la funcionalidad de la tecnolog&#237;a y programas del master data management (MDM) proporcionan una mejor soluci&#243;n que el flujo ETL. &#161;Y no solo porque es duro!. El ritmo del proceso ETL,  donde queremos que la base en funcionamiento sea a prueba de balas, es  un inconveniente con el proceso de deduplicaci&#243;n.&lt;/p&gt;
&lt;p&gt;No importa lo buenas que sean nuestras herramientas, como de inteligente sea nuestro c&#243;digo, como de completas sean nuestras reglas de negocio, el proceso automatizado de deduplicaci&#243;n no puede alcanzar el 100% de precisi&#243;n. Se requiere una persona para juzgar los casos cuestionables. Funciona mucho mejor si esto es una responsabilidad profesional durante los d&#237;as laborables, m&#225;s que esperar a la carga del ETL.&lt;/p&gt;
&lt;p&gt;Un simple sistema MDM se puede utilizar para construir datos con valor a&#241;adido. Las dimensiones jer&#225;rquicas son mejores cuando son estructuradas desde los escritorios de los usuarios. Las herramientas MDM proporcionan una plataforma simple para gestionar esta informaci&#243;n.&lt;/p&gt;
&lt;h3&gt;6. Que no se excluya el data warehouse relacional.&lt;/h3&gt;
&lt;p&gt;Dise&#241;ar y llenar el data warehouse conformado de una empresa es duro. A todo el mundo le gustar&#237;a saltarse este paso. A lo largo de los m&#225;s de 23 a&#241;os de carrera en data warehousing, he observado  numerosos intentos para simplificar el proceso, desde construir la capa BI directamente desde el sistema de transacciones, hasta los llamados data warehouses virtuales, volviendo al ciclo actual de scripts de creaci&#243;n de  herramientas de visualizaci&#243;n.&lt;/p&gt;
&lt;p&gt;Como coment&#233; en el &lt;a href=&quot;http://www.kimballgroup.com/2014/01/design-tip-162-leverage-data-visualization-tools-but-avoid-anarchy/&quot;&gt;Consejo de dise&#241;o #162&lt;/a&gt;, aprovecha las herramientas de visualizaci&#243;n de datos, pero evita la anarqu&#237;a. A menos que controles completamente todos tus datos de origen, debes dejar el ETL para la herramienta ETL, dejar el almacenamiento de datos y la gesti&#243;n a un motor de database relacional, y dejar que las herramientas BI sean brillantes en lo que mejor hacen: grandes visualizaciones y experiencia de usuario.&lt;/p&gt;
&lt;h3&gt;7. Todo se trata del negocio.&lt;/h3&gt;
&lt;p&gt;Digo esto muchas veces durante mis clases y consultas. Es la caracter&#237;stica m&#225;s importante del m&#233;todo Kimball Lifecycle: Mant&#233;n el foco incuestionablemente en el negocio. Afecta a todo lo que hacemos y es el mensaje m&#225;s importante que transmitir hacia el futuro.&lt;/p&gt;
&lt;h2&gt;Mirando al futuro&lt;/h2&gt;
&lt;p&gt;Me siento incre&#237;blemente afortunada de haber formado parte del Kimball Group durante los &#250;ltimos 12 a&#241;os. Ha sido un honor trabajar no solo con Ralph, Margy, Bob y Warren, sino tambi&#233;n con los cientos de estudiantes, clientes y colegas con los que he aprendido tanto.  Me honra lo que hemos conseguido juntos, y me siento bendecida por lo que considero el mejor trabajo del mundo.&lt;/p&gt;
&lt;p&gt;Me siento particularmente afortunada en comparaci&#243;n con Warren, que falleci&#243; el a&#241;o pasado de c&#225;ncer cerebral y su muerte me afect&#243; profundamente tanto a m&#237; como al toda la gente del Kimball Group. En 2016, homenajear&#233; a Warren y su pasi&#243;n por el fitness haciendo ciclismo por todo Estados Unidos para recaudar fondos para la investigaci&#243;n del c&#225;ncer cerebral. Me honrar&#225; si sigues nuestro blog que narrar&#225; este viaje (&lt;a href=&quot;https://itinerantphilosopher.org/&quot;&gt;https://itinerantphilosopher.org/&lt;/a&gt;) y me emocionar&#233; si consideras hacer una donaci&#243;n por nuestros esfuerzos para recaudar fondos de investigaci&#243;n para el c&#225;ncer cerebral.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/conceptos-probados-y-ciertos-datawarehouse-businessintelligence.html</guid>
      <link>https://datawarehouse.es/2015/conceptos-probados-y-ciertos-datawarehouse-businessintelligence.html</link>
      <title>Consejo de dise&#241;o #178: Conceptos probados y ciertos para el &#233;xito del DW-BI</title>
      <pubDate>Fri, 06 Jan 2017 02:15:23 GMT</pubDate>
      <atom:updated>2017-01-06T02:15:23Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/&quot; /&gt;
	  &lt;p&gt;El tiempo pasa y pronto llegar&#225; la jubilaci&#243;n colectiva del Kimball Group. A finales de 2015 nos jubilaremos. En mi &#250;ltimo &amp;quot;Consejo de dise&#241;o&amp;quot; me gustar&#237;a compartir la perspectiva para el &#233;xito del DW/BI que he alcanzado durante mis 26 a&#241;os en el negocio del data warehouse/business intelligence.&lt;/p&gt;
&lt;p&gt;Mientras que el data warehousing existe desde hace mucho, contin&#250;an habiendo oportunidades importantes de aprovechar la informaci&#243;n para una toma de decisiones m&#225;s efectiva. Constantemente surgen nuevas tecnolog&#237;as que crean y nos permiten recopilar cada vez m&#225;s datos granulados del mundo que nos rodea. Los datos y las anal&#237;ticas que los rodean son tan interesantes e importantes como siempre – quiz&#225;s incluso m&#225;s. Nuevas y mejoradas soluciones DW/BI continuar&#225;n para ser implementadas. No habr&#225; futuro con carencia de oportunidades para aplicar las lecciones aprendidas sobre c&#243;mo crear un entorno DW/BI de &#233;xito.&lt;/p&gt;
&lt;p&gt;Reconocemos que el data warehousing es una industria que ha madurado. Hemos pasado la etapa embrionaria de la evoluci&#243;n del DW/BI. Estamos trabajando con hardware probado y capacitado y con tecnolog&#237;as de software nuevas y m&#225;s potentes que evolucionan continuamente. Como industria, hemos estado implementando data warehouses y sistemas de Business Intelligence durante mucho tiempo (d&#233;cadas, de hecho). Hemos aprendido lecciones, mejorado tecnolog&#237;as, perfilado t&#233;cnicas y madurado metodolog&#237;as. Numerosos individuos han sido entrenados, bautizados con el fuego de la experiencia, y han demostrado ser capaces de construir soluciones DW/BI de &#233;xito. Claramente, siempre habr&#225; novatos que entrenar, de los que ser mentores y a los que haya que profesionalizar. Sin embargo, como industria, sabemos lo que cuesta tener &#233;xito. No hay excusas para fallar.&lt;/p&gt;
&lt;p&gt;Mi recomendaci&#243;n para el &#233;xito &lt;strong&gt;continuado&lt;/strong&gt; es mantener tus ojos bien abiertos y centrarse constantemente en lo b&#225;sico. Abraza estos conceptos probados y ciertos que a&#241;os de experiencia han revelado como certeros:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;C&#233;ntrate en el negocio y sus necesidades:&lt;/strong&gt; Nunca olvides mantener un foco  de atenci&#243;n en adquirir valor empresarial. El &#233;xito de una iniciativa DW/BI depende totalmente del compromiso del usuario de negocio; manteniendo involucrados a los usuarios de negocio y conociendo sus necesidades se incrementa dr&#225;sticamente la probabilidad de &#233;xito. De hecho, la asegura.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Obt&#233;n patrocinio fuerte de la alta direcci&#243;n:&lt;/strong&gt; la falta de apoyo organizacional compromete el &#233;xito de la iniciativa DW/BI. La alta direcci&#243;n debe aceptar, apoyar, dirigir y financiar estos esfuerzos como programas a largo plazo.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Organ&#237;zate para el &#233;xito:&lt;/strong&gt; Las iniciativas DW/BI de &#233;xito son emprendidas como una asociaci&#243;n entre el equipo IT y las unidades de negocio. El esfuerzo para llevar a cabo el DW/BI no se puede identificar solo como un esfuerzo de IT. La comunidad de negocio (no IT) necesita tomar posesi&#243;n de la visi&#243;n, la estrategia, la hoja de ruta (prioridades), alcance, los plazos, el gobierno y la calidad del entorno del DW/BI.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;La integraci&#243;n es cr&#237;tica:&lt;/strong&gt; Aprovechar las dimensiones conformadas como la base de integraci&#243;n. Entiende y abraza la disciplina del dise&#241;o dimensional como el tema de organizaci&#243;n de los datos dentro del entorno DW/BI.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Establece y aplica vocabulario com&#250;n:&lt;/strong&gt; El primer paso para eliminar los problemas de  inconsistencia en los datos es establecer y aplicar nombres comunes, definiciones y descripciones en todo el entorno DW/BI. De nuevo, abrazar la disciplina del modelado dimensional es el secreto de la victoria.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;C&#233;ntrate en la calidad de los datos:&lt;/strong&gt; En su creaci&#243;n, el entorno DW/BI debe ser un repositorio de datos de alta calidad. Los desaf&#237;os m&#225;s grandes para la mayor&#237;a de iniciativas DW/BI est&#225;n relacionados con los datos. En general, la iniciativa de desarrollar el proceso ETL requerido para proporcionar datos de alta calidad es normalmente m&#225;s exigente de lo que se esperaba. Tiempo y recursos adecuados, incluyendo a expertos en materias clave, deben ser asignados a estas tareas.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Establece un dise&#241;o escalonado, desarrollo y un plan de implementaci&#243;n:&lt;/strong&gt; Construir un entorno DW/BI es un esfuerzo significativo. Es casi imposible abordar todo al mismo tiempo.  Adopta un plan de desarrollo iterativo que evite  un alcance excesivamente ambicioso. Las iteraciones del proyecto necesitan ser identificadas para incorporar el dise&#241;o general, desarrollo e implementaci&#243;n. El entorno debe crecer abordando nuevos y adicionales procesos empresariales (p.e.; tablas de hechos).&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Muestra paciencia:&lt;/strong&gt; La fase inicial de una iniciativa DW/BI normalmente requiere un periodo desproporcionadamente largo; yo le llamo “el gran trago”. Esto es necesariamente cierto. Mientras que la fase inicial corresponde a implementar un solo proceso empresarial, la mayor parte del tiempo en esta fase se dedica a dise&#241;ar, desarrollar e implementar el conjunto b&#225;sico cr&#237;tico de dimensiones conformadas que ser&#225;n potenciadas en todo el entorno DW/BI en fases posteriores. Esto es normal y debe ser esperado.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Finalmente, como nota personal, me gustar&#237;a agradecer a mis clientes, estudiantes, compa&#241;eros, familia y amigos su apoyo durante estos a&#241;os. He aprendido m&#225;s de todos vosotros de lo que nunca apreciar&#233;is. Cada uno de vosotros tiene mi m&#225;s profunda gratitud.&lt;/p&gt;
&lt;p&gt;&#161;Gracias y Buena suerte!&lt;/p&gt;
&lt;p&gt;Bob&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/design-tip-177-colaboracion.html</guid>
      <link>https://datawarehouse.es/2015/design-tip-177-colaboracion.html</link>
      <title>Consejo de dise&#241;o  #177: La colaboraci&#243;n entre negocio e  IT</title>
      <pubDate>Fri, 06 Jan 2017 00:58:16 GMT</pubDate>
      <atom:updated>2017-01-06T00:58:16Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/&quot; /&gt;
	  &lt;p&gt;En el &#250;ltimo &amp;quot;consejo de dise&#241;o&amp;quot;, vuelvo a un tema fundamental que no es ninguna cosa compleja pero es ignorada con demasiada frecuencia: &lt;strong&gt;La colaboraci&#243;n entre negocio e  IT&lt;/strong&gt;. Si aceptas la proposici&#243;n de que la verdadera medida del &#233;xito del DW/BI es el uso del sistema por parte del usuario negocio, entonces aceptar la importancia de la colaboraci&#243;n deber&#237;a ser f&#225;cil. Lograr la aceptaci&#243;n empresarial es una utop&#237;a si el equipo de IT no colabora con su contraparte empresarial. Del mismo modo, Negocio necesita estar deseando colaborar con el IT.&lt;/p&gt;
&lt;p&gt;Los equipos colaborativos multidisciplinares crean sistemas DW/BI de &#233;xito. Cada cuesti&#243;n importante del enfoque &amp;quot;Kimball Lifecycle&amp;quot; se presta a actividades conjuntas que refuerzan la alineaci&#243;n negocios-IT:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Planificaci&#243;n del proyecto:&lt;/strong&gt; Marca prioridades basadas en metas y objetivos empresariales, proponiendo unos entregables realistas.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Direcci&#243;n del proyecto:&lt;/strong&gt; Comunicar abiertamente sobre la situaci&#243;n del proyecto y solicitar &amp;quot;feedback&amp;quot; para definir modificaciones en el alcance de manera consensuada.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Requerimientos empresariales:&lt;/strong&gt; Incidir en lo que hace el negocio y por qu&#233;, y en como la empresa espera tomar las decisiones en el futuro, en lugar de preguntar “&#191;qu&#233; quieres en un sistema DW/BI?”&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Arquitectura t&#233;cnica y selecci&#243;n de productos:&lt;/strong&gt; Involucra a los representantes de la empresa para seleccionar sus herramientas. Como un recordatorio amistoso a los ingenieros: la tecnolog&#237;a es un habilitador previo, &#161;pero no debe ser el foco de atenci&#243;n primario del equipo DW/BI! No te molestes en educar (o tal vez educar en exceso) al negocio sobre infraestructura y tuber&#237;as.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Modelado dimensional:&lt;/strong&gt; Derivar modelos dimensionales de talleres interactivos con negocio y representantes IT en lugar de dejarlo en manos de un dise&#241;ador solitario sentado en una torre de  marfil. Contratar a expertos en la materia del negocio es absolutamente necesario para dise&#241;ar modelos dimensionales apropiados. Deben estar incluidos en el descubrimiento de datos y en las decisiones asociadas al gobierno de los datos.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;El dise&#241;o y desarrollo del ETL:&lt;/strong&gt; Hacer una lista de expertos en la materia empresarial para enlazar adecuadamente los problemas en la calidad de datos con representante IT. IT no debe tomar estas decisiones en solitario.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Dise&#241;o y desarrollo de la aplicaci&#243;n BI:&lt;/strong&gt; El prototipo BI se crea y analiza con el negocio.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Implementaci&#243;n:&lt;/strong&gt; Solicita aportaci&#243;n empresarial sobre las necesidades iniciales y continuas de educaci&#243;n y apoyo.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Puesto que muchos suscriptores a este sitio pertenecen al departamento de IT, me he centrado en la importancia de que IT rompa barreras con el negocio. De esta manera, ver&#225;n a sus colegas como colaboradores en lugar de como cuellos de botella. Pero la colaboraci&#243;n se debe dar en los dos sentidos. Es igual de importante que los representantes de negocio colaboren con su contraparte IT considerando la siguiente gu&#237;a:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Invita a IT a sentarse contigo durante las sesiones de estrategia.&lt;/li&gt;
&lt;li&gt;Invierte tiempo en educar a IT acerca del negocio. Cuanto m&#225;s sepa IT, mejor te podr&#225;n apoyar tus necesidades. Es insuficiente e inefectivo proporcionar a IT simplemente un informe con las especificaciones del conjunto de datos.&lt;/li&gt;
&lt;li&gt;Contrata IT en el principio de la iniciativa en lugar de esperar a la mitad del proyecto (o despu&#233;s de que tus consultores se hayan ido).&lt;/li&gt;
&lt;li&gt;Aprecia la necesidad de IT de pensar sobre la empresa, no solo en tu departamento individual. Sus preocupaciones referentes al gobierno de datos y los &amp;quot;metadatos&amp;quot; son reales.&lt;/li&gt;
&lt;li&gt;Esfu&#233;rzate en evitar la proliferaci&#243;n de conjuntos de datos, informes y an&#225;lisis similares, pero ligeramente diferentes. Esta proliferaci&#243;n normalmente termina en costes directos e indirectos significativos para la organizaci&#243;n.&lt;/li&gt;
&lt;li&gt;Aprovecha la experiencia IT. No tomes decisiones sobre la tecnolog&#237;a sin involucrarles. Y preg&#250;ntate a ti mismo si realmente quieres mantener los silos de datos y aplicaciones con proveedores sin la ayuda de IT.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;El enfoque Kimball disuade la mentalidad cliente-vendedor donde el negocio proporciona al IT una orden que este intenta realizar. Nuestro enfoque siempre defiende la asociaci&#243;n entre IT y las partes interesadas del negocio. La colaboraci&#243;n va m&#225;s all&#225; de programar una reuni&#243;n con las partes interesadas; colaborar significa trabajar diferente, involucrar a ambas partes en tomar decisiones.&lt;/p&gt;
&lt;p&gt;Desafortunadamente, la colaboraci&#243;n entre el negocio y IT no se da de manera natural en algunas organizaciones. La gente puede pensar diferente, comunicar usando diferente vocabulario y ser incentivada de manera diferente. La meta es involucrarse mutuamente y entender que se requiere un fuerte apoyo organizacional en los niveles de liderazgo, especialmente si negocio e IT necesitan ser empujados fuera de su zona de confort. La l&#237;nea que separa ambos campos se difuminar&#225; con personas que cabalgan c&#243;modamente entre ambos mundos.&lt;/p&gt;
&lt;h3&gt;Despedida&lt;/h3&gt;
&lt;p&gt;Finalmente, os comunico que esta es mi &#250;ltima oportunidad de hablar con todos vosotros. Quiero expresar mi gratitud y aprecio por las numerosas personas que se han cruzado en mi camino durante los &#250;ltimos 34 a&#241;os. Gracias a mi marido y a mi hija por vuestra paciencia inquebrantable y vuestro apoyo. Gracias a mis colegas de Metaphor cuya influencia ha persistido durante mi carrera. Gracias a mis socios de DecisionWorks y Kimball Group por vuestra inteligencia e inspiraci&#243;n. Y lo m&#225;s importante, gracias a mis clientes, estudiantes y lectores; &#161;hab&#233;is hecho que sea un viaje incre&#237;ble!&lt;/p&gt;
&lt;p&gt;Bajar la persiana siempre duro. Mientras el Kimball Group est&#225; cerrando sus puertas, nuestros m&#233;todos vivir&#225;n a trav&#233;s de vosotros.&lt;/p&gt;
&lt;p&gt;&#161;Buena suerte! Solo recordad: &#161;centraos en el negocio y sed dimensionales!&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2015/perfiles-peligrosos.html</guid>
      <link>https://datawarehouse.es/2015/perfiles-peligrosos.html</link>
      <title>Consejo de dise&#241;o #173: Los perfiles peligrosos son un peligro para el negocio</title>
      <pubDate>Tue, 27 Dec 2016 10:46:45 GMT</pubDate>
      <atom:updated>2016-12-27T10:46:45Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/2015-perfiles-peligrosos.jpg&quot; /&gt;
	  &lt;p&gt;A lo largo de los a&#241;os, hemos trabajado con incontables y ejemplares miembros de proyectos DW/BI: brillantes, expertos, dedicados y motivados, en comuni&#243;n con una dosis sana de confianza mutua, respeto y camarader&#237;a con sus compa&#241;eros de equipo. Equipos con miembros que poseen estas caracter&#237;sticas tienden a trabajar a m&#225;ximo rendimiento con un resultado global mejor que el obtenido por la suma de las partes.&lt;/p&gt;
&lt;p&gt;Pero tambi&#233;n hemos llevado a cabo proyectos con &amp;quot;personas de riesgo&amp;quot;; adem&#225;s de ser no-contribuyentes individuales, pueden minar la efectividad de todo el equipo DW/BI. Esperamos que tu equipo no incluya recursos que  padezcan las siguientes perfiles:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;contendientes obstruccionistas&amp;quot;&lt;/em&gt;&lt;/strong&gt; son opositores perpetuos que encuentran pegas a todo y obtienen mayor satisfacci&#243;n en el proceso de debate que en el proceso de decisi&#243;n.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;buscadores de novedades&amp;quot;&lt;/em&gt;&lt;/strong&gt;,  que siempre est&#225;n ansiosos de probar lo &#250;ltimo, los mejores gadgets y artilugios t&#233;cnicos sin importar si siguen los objetivos del proyecto DW/BI.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;cortadores de galletas&amp;quot;&lt;/em&gt;&lt;/strong&gt; (&lt;em&gt;cookie cutters&lt;/em&gt;), que contin&#250;an haciendo exactamente lo que se les mand&#243; en el pasado, sin tener en cuenta sus &#250;ltimos matices asignados.&lt;/li&gt;
&lt;li&gt;Las &lt;strong&gt;&lt;em&gt;&amp;quot;malas hierbas&amp;quot;&lt;/em&gt;&lt;/strong&gt; pierden de vista el bosque desde los &#225;rboles, se centran exclusivamente en los detalles menos importantes sin tener en cuenta la visi&#243;n global.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;estudiantes e investigadores perpetuos&amp;quot;&lt;/em&gt;&lt;/strong&gt; quieren leer y leer, y leer algo m&#225;s, pero tienen pocas ganas de pasar a la acci&#243;n porque siempre hay algo m&#225;s que aprender.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;esp&#237;ritus independientes&amp;quot;&lt;/em&gt;&lt;/strong&gt; marchan siguiendo su propio ritmo sin prestar atenci&#243;n a las reglas, est&#225;ndares y las mejores pr&#225;cticas aceptadas.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;educados oculta-problemas&amp;quot;&lt;/em&gt;&lt;/strong&gt;, que siempre asienten con un &amp;quot;s&#237;&amp;quot;  y dicen “no problem”, incluso cuando problemas serios aguardan en la esquina.&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&lt;em&gt;&amp;quot;incompetentes disfuncionales y jubilados mentales&amp;quot;&lt;/em&gt;&lt;/strong&gt; est&#225;n paralizados y son incapaces de actuar.&lt;/li&gt;
&lt;li&gt;Los que se &lt;em&gt;auto-declaran expertos sabelotodo&lt;/em&gt; no necesitan escuchar porque ya tienen todas las respuestas. &#161;Simplemente preg&#250;ntales!&lt;/li&gt;
&lt;li&gt;Los &lt;strong&gt;&amp;quot;&lt;em&gt;sobrepreocupados por las amenazas&amp;quot;&lt;/em&gt;&lt;/strong&gt; est&#225;n tan paralizados por el miedo a lo que pueda pasar que responden no haciendo nada.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Por supuesto, incluso con compa&#241;eros superestrella, un buen liderazgo para el grupo es necesario. Esperamos que tu director de proyecto DW/BI se ajuste a lo siguiente:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Establece una colaboraci&#243;n con el negocio, incluyendo tomar responsabilidad en la propiedad del proyecto DW/BI. De este modo, los l&#237;deres son respetados por la empresa por estar orientados hacia el usuario m&#225;s que hacia la tecnolog&#237;a.&lt;/li&gt;
&lt;li&gt;Demuestra excelentes aptitudes interpersonales y organizacionales, ya que el proyecto/programa DW/BI comprende una perspectiva pol&#237;tica y cultural.&lt;/li&gt;
&lt;li&gt;Recluta y retiene recursos con el talento requerido,  consigue que trabajen con cohesi&#243;n con un mismo libro de t&#225;cticas, y entiende que a&#241;adir jugadores mediocres no incrementa las oportunidades de ganar. Por otro lado, tambi&#233;n se&#241;ala a los individuos que retrasan el esfuerzo y los asesoran proactivamente (o al menos minimizan el riesgo de que el proyecto descarrile).&lt;/li&gt;
&lt;li&gt;Escucha con mucha atenci&#243;n,  adem&#225;s comunica de manera efectiva y honesta, estableciendo las expectativas adecuadas para decir “no” cuando sea necesario.&lt;/li&gt;
&lt;li&gt;Posee un dominio profesional &#243;ptimo del DW/BI, adem&#225;s de grandes habilidades de direcci&#243;n de proyecto. Como m&#237;nimo, se mantiene un cap&#237;tulo por delante del equipo de proyecto en &lt;a href=&quot;https://datawarehouse.es/ralph-kimball-books.html&quot;&gt;The Data Warehouse Lifecycle Toolkit&lt;/a&gt;…&lt;/li&gt;
&lt;li&gt;Entiende que el &#233;xito del DW/BI est&#225; directamente relacionado con el periodo de aceptaci&#243;n del negocio.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Los directores de proyectos inexpertos, inefectivos o indecisos que no muestren estas caracter&#237;sticas son igualmente recursos de riesgo para el proyecto.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2011/recomendaciones-testing-datawarehouse.html</guid>
      <link>https://datawarehouse.es/2011/recomendaciones-testing-datawarehouse.html</link>
      <title>Consejo de die&#241;o #134: Recomendaciones para las pruebas del Data Warehouse</title>
      <pubDate>Thu, 03 Nov 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-11-03T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/&quot; /&gt;
	  &lt;p&gt;La validaci&#243;n de un entorno datawarehouse/BI es un gran reto. La metodolog&#237;a de validaci&#243;n est&#225;ndar valida s&#243;lo una peque&#241;a cosa a la vez. Sin embargo, la naturaleza de un sistema DW/BI versa sobre integraciones complejas, sin mencionar el elevado volumen de datos. Aqu&#237; est&#225;n mis 5 recomendaciones principales para construir y ejecutar un test en el entorno de tu proyecto DW/BI.&lt;/p&gt;
&lt;h2&gt;1. Crea un peque&#241;o test est&#225;tico de la base de datos, derivado de los datos reales.&lt;/h2&gt;
&lt;p&gt;Necesitas que sea peque&#241;o para que el test se realice r&#225;pidamente. Necesitas que sea est&#225;tico para conocer de antemano los resultados esperados. Y necesitas que derive de datos reales porque no hay nada como los datos reales para ofrecer una combinaci&#243;n realista de escenarios buenos y malos. Necesitar&#225;s a&#241;adir filas en el test de la base de datos para probar que cada una de las instrucciones de tu c&#243;digo ETL cubre un escenario no incluido en el test de datos original.&lt;/p&gt;
&lt;h2&gt;2. Comprueba pronto y con regularidad.&lt;/h2&gt;
&lt;p&gt;Empieza comprobando tan pronto como escribas una l&#237;nea de c&#243;digo (o conectas dos cajas en el UI de tu herramienta ETL). Los desarrolladores hacen esto todo el tiempo, por supuesto. Desarrollar implica poner en marcha tests unitarios para asegurar que su c&#243;digo funciona como se espera. Muchos desarrolladores no son tan buenos siguiendo la evoluci&#243;n de esas pruebas y realiz&#225;ndolas frecuentemente. Diariamente. Cada vez que se realiza un commit en tu c&#243;digo. Si realizas el test cada d&#237;a, y priorizas en mejorar cada test que fall&#243; ayer, ser&#225; m&#225;s f&#225;cil determinar aquello que no funcion&#243;.&lt;/p&gt;
&lt;p&gt;La prueba unitaria asegura que el c&#243;digo desarrollado funciona tal y como se ha dise&#241;ado. La prueba del sistema asegura que el sistema en completo funciona, de acuerdo con las especificaciones. La prueba del sistema tambi&#233;n se deber&#237;a realizar pronto.&lt;/p&gt;
&lt;p&gt;Hay una &amp;quot;fase de test&amp;quot; oficial antes de la puesta en funcionamiento del DWH. Esta fase de tests es para llevar a cabo las pruebas y reconocer problemas, no para identificar como deber&#237;an ser los tests y como llevarlos a cabo. &lt;strong&gt;Se debe  empezar a probar el sistema al inicio del proceso de desarrollo&lt;/strong&gt;, de esta manera todos los detalles se resuelven mucho antes de empezar con la &amp;quot;fase de test&amp;quot; oficial, que supone mayor presi&#243;n para el funcionamiento correcto del sistema.&lt;/p&gt;
&lt;h2&gt;3. Utilizar herramientas de prueba y automatizar el entorno de prueba.&lt;/h2&gt;
&lt;p&gt;La recomendaci&#243;n de hacer el test pronto y regularmente es pr&#225;ctica solamente si automatizas el proceso. Ning&#250;n desarrollador va a utilizar hasta la &#250;ltima de su d&#237;a de trabajo haciendo de ni&#241;era de la prueba unitaria. Y pocos equipos pueden permitirse un controlador a tiempo completo para hacer ese trabajo en lugar del desarrollador. Para automatizar la prueba, necesitas herramientas. Muchas organizaciones ya disponen “in situ” de herramientas para comprobar la calidad de las pruebas. Si tu no las tienes, o est&#225;s convencido de que las herramientas de las que dispones no responden a las necesidades de control del sistema DW/BI, intenta buscar en google “herramientas de software para asegurar la calidad” para disponer de una inmensa lista de productos y metodolog&#237;as disponibles a una extensa gama de precios.&lt;/p&gt;
&lt;p&gt;Todos los software comerciales de herramientas de prueba te permitir&#225;n formular tests, ejecutar tests, registrar los resultados de los tests realizados y informar de esos resultados. Para la prueba de la unidad y prueba de la calidad de los datos, define los tests para llevar a cabo una consulta en la fuente y el objetivo del almac&#233;n de datos. &lt;strong&gt;Tienes que buscar el recuento de filas y cantidades para hacerlas coincidir.&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Una herramienta de testing utilizada para probar el DW/BI debe ser capaz de ejecutar un escenario que establezca el entorno de prueba antes de que las pruebas se lleven a cabo. Las tareas que necesitar&#225; ejecutar incluyen:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Restaurar un entorno de m&#225;quina virtual con un test de datos limpio.&lt;/li&gt;
&lt;li&gt;Modificar el test est&#225;tico de datos con filas especiales para probar condiciones inusuales.&lt;/li&gt;
&lt;li&gt;Ejecutar tu programa ETL&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Despu&#233;s de ejecutar y registrar los tests, termina con un &lt;em&gt;script&lt;/em&gt; de limpieza, que deber&#237;a ser tan simple como eliminar el entorno VM.&lt;/p&gt;
&lt;p&gt;La metodolog&#237;a de prueba est&#225;ndar cambia una cosa, ejecuta un test y registra los resultados. En el mundo del DW/BI, debes agrupar juntos muchos tests en un grupo de tests. Incluso con una base de datos peque&#241;a, no tienes que ejecutar tu c&#243;digo ETL para cada una de los centenares de unidades que deber&#237;an estar funcionando.&lt;/p&gt;
&lt;h2&gt;4. Haz una lista de los usuarios de negocios para definir los tests del sistema.&lt;/h2&gt;
&lt;p&gt;Necesitamos la experiencia de los usuarios para definir buenos tests para el sistema. &#191;C&#243;mo sabemos que los datos son correctos? &#191;C&#243;mo sabemos que el rendimiento de las consultas cumple sus expectativas? Hacer una lista de los usuarios de negocios durante el proceso de especifiaci&#243;n del test asegurar&#225; una mejor prueba que si simplemente el equipo DW/BI construye tests basados en lo que creen que es interesante. Contar con los usuarios de negocios clave en el proceso de aseguramiento de la calidad tambi&#233;n proporciona un impulso enorme en la credibilidad.&lt;/p&gt;
&lt;h2&gt;5. El test del entorno debe ser tan similar como sea posible al entorno de producci&#243;n.&lt;/h2&gt;
&lt;p&gt;Es de vital importancia que el entorno de test sea similar al de producci&#243;n. Ser&#237;a ideal que fuese el mismo hardware, software y configuraci&#243;n. En el mundo real, relativamente pocas organizaciones tienen presupuesto para tener dos servidores DW grandes. Pero cualquier organizaci&#243;n puede, y debe, hacer coincidir los siguientes elementos:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Configuraci&#243;n de la unidad (nombres relativos de las unidades). El disco es barato y debes ser capaz de duplicar tu disco para su test. Pero si no puedes, al menos haz que los escritos de la unidad y el archivo de la base de datos tengan la misma disposici&#243;n. Mucha gente se queja de que esto significa mucho trabajo para cambiar el entorno . &#161;Lo es! Y es mucho mejor hacerlo ahora que en la fase final del test de tu proyecto.&lt;/li&gt;
&lt;li&gt;Las versiones de software del sistema operativo de la base de datos con la base de datos de los escritorios de los usuarios, y todo aquello que los relacione.&lt;/li&gt;
&lt;li&gt;Dise&#241;o del servidor. Si el software de reporting est&#225; en su propio servidor de producci&#243;n, pru&#233;balo de esa manera.&lt;/li&gt;
&lt;li&gt;Roles de seguridad y privilegios para las cuentas de mantenimiento. Tu despliegue est&#225; virtualmente relegado al fracaso si no compruebas los roles de seguridad primero. No s&#233; porque, pero siempre parece que va a ir mal.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;strong&gt;Si sigues estas sugerencias, especialmente la sugerencia de probar continuamente, probablemente tengas una fase de test agradable y sin crisis y cumplir&#225;s el hito de pase a producci&#243;n en  la fecha programada.&lt;/strong&gt;  Si no, est&#225;s corriendo un serio riesgo de retrasar interminablemente un fabuloso proyecto en el infierno QA, con los usuarios de negocios y la direcci&#243;n llamando a tu puerta.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2009/ciclo-de-vida-kimball.html</guid>
      <link>https://datawarehouse.es/2009/ciclo-de-vida-kimball.html</link>
      <title>Consejo de dise&#241;o #115: El ciclo de vida Kimball resumido.</title>
      <pubDate>Thu, 03 Nov 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-11-03T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/&quot; /&gt;
	  &lt;p&gt;Recientemente, en una clase sobre el Lifecycle del Data Warehouse un estudiante me pregunt&#243; a cerca de una visi&#243;n resumida del enfoque Kimball para compartirlo con su director. Estaba contento de que me preguntara porque asum&#237;a que hab&#237;amos publicado un resumen ejecutivo sobre esto. Para mi sorpresa, nuestra &#250;nica publicaci&#243;n sobre la visi&#243;n del ciclo de vida era un cap&#237;tulo en un libro de  herramientas de ayuda. Este consejo de dise&#241;o incluye el vac&#237;o de contenido inesperado en nuestros archivos.&lt;/p&gt;
&lt;p&gt;El enfoque Kimball sobre el ciclo de vida lleva d&#233;cadas siendo utilizado. Los conceptos fueron inicialmente establecidos en 1980 por miembros de Kimball Group y diversos colegas de &lt;em&gt;Metaphor Computer Systems&lt;/em&gt;. Cuando publicamos la metodolog&#237;a por primera vez en The Data Warehouse Lifecycle Toolkit en 1998, lo  llamamos &lt;em&gt;&amp;quot;Business Dimensional Lifecycle&amp;quot;&lt;/em&gt; porque este t&#237;tulo reforzaba tres conceptos fundamentales:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Se centraba en a&#241;adir valor empresarial en la organizaci&#243;n&lt;/li&gt;
&lt;li&gt;Estructuraba  dimensionalmente los datos proporcionados a negocio v&#237;a reportes y consultas.&lt;/li&gt;
&lt;li&gt;Desarrollaba iterativamente la soluci&#243;n en incrementos manejables antes que pensar en un Big Bang entregable.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Rebobinando a 1990, nuestra metodolog&#237;a fue una de las pocas que recalcaban este conjunto de principios centrales, por tanto el t&#237;tulo El “Business Dimensional Lifecycle” diferenciaba nuestro enfoque de otros existentes en la industria.&lt;/p&gt;
&lt;p&gt;En un avance r&#225;pido hacia 2008 cuando publicamos la segunda edici&#243;n de “&lt;em&gt;The Data Warehouse Lifecycle Toolkit&lt;/em&gt;”, todav&#237;a creemos absolutamente en estos conceptos, pero la industria ha evolucionado. Nuestros principios hab&#237;an llegado a ser la corriente principal en las mejores pr&#225;cticas ofrecidas por muchos, as&#237; que reducimos el nombre oficial de la metodolog&#237;a a simplemente &amp;quot;&lt;em&gt;Kimball Lifecylce&lt;/em&gt;&amp;quot;.&lt;/p&gt;
&lt;p&gt;A pesar de  los avances dram&#225;ticos en tecnolog&#237;a y entendimiento durante las dos &#250;ltimas d&#233;cadas, las construcciones b&#225;sicas del ciclo de vida de Kimball han permanecido sorprendentemente constantes.&lt;/p&gt;
&lt;p&gt;Nuestro enfoque para el dise&#241;o, desarrollando una y otra vez soluciones DW/BI, est&#225; probado y verificado. Ha sido utilizados por miles de equipos de proyectos virtualmente en todas las industrias, en el &#225;rea de aplicaci&#243;n, en las funciones de negocio y en las plataformas de negocio. Una y otra vez se ha comprobado que el enfoque del &lt;em&gt;Lifecylce Kimball&lt;/em&gt; funciona.&lt;/p&gt;
&lt;p&gt;El enfoque Kimball del Ciclo de vida se ilustra en la Figura 1. Una implementaci&#243;n exitosa del DW/BI depende de una combinaci&#243;n apropiada de numerosas tareas y componentes.  No es suficiente tener un modelo de datos perfecto o la mejor tecnolog&#237;a desarrollada. El diagrama del ciclo de vida es la hoja de ruta general que describe las tareas requeridas para un dise&#241;o efectivo, desarrollo y despliegue.&lt;/p&gt;
&lt;p&gt;&lt;img src=&quot;https://datawarehouse.es/images/dt-115-lifecycle-kimball.png&quot; alt=&quot;Imagen 1&quot; /&gt;&lt;/p&gt;
&lt;p&gt;Figura 1. El diagrama del Ciclo de vida Kimball.&lt;/p&gt;
&lt;h3&gt;Direcci&#243;n y planificaci&#243;n del programa/proyecto&lt;/h3&gt;
&lt;p&gt;El primer recuadro en la ruta se centra en conseguir lanzar el programa/proyecto, incluyendo la determinaci&#243;n del alcance, la justificaci&#243;n y la dotaci&#243;n de personal. A lo largo del ciclo de vida, la planificaci&#243;n y la direcci&#243;n de las tareas del proyecto mantiene las actividades en marcha.&lt;/p&gt;
&lt;h3&gt;Requisitos del negocio&lt;/h3&gt;
&lt;p&gt;Identificar las necesidades del negocio es una tarea clave en el ciclo de vida Kimball ya que estos descubrimientos dirigen la mayor&#237;a de decisiones ascendentes y descendentes. Las necesidades se recogen para determinar los factores clave que repercuten en el negocio centr&#225;ndose en lo que los usuarios de negocio hacen hoy (o lo que quieren hacer en el futuro) en lugar de preguntar “&#191;Qu&#233; quieres almacenar en el almac&#233;n de datos?”, se identifican las oportunidades m&#225;s significativas en la empresa, bas&#225;ndose en el valor del negocio y su viabilidad. Posteriormente las necesidades detalladas son recopiladas en la primera iteraci&#243;n del sistema de desarrollo DW/BI. Tres rutas paralelas del ciclo de vida siguen la definici&#243;n de las necesidades.&lt;/p&gt;
&lt;h3&gt;Ruta de tecnolog&#237;a&lt;/h3&gt;
&lt;p&gt;Los entornos DW/BI se encargan de la integraci&#243;n de numerosas tecnolog&#237;as, almacenes de datos y metadatos asociados. La ruta de la tecnolog&#237;a empieza con el dise&#241;o del sistema de arquitectura para establecer una lista de la compra de las capacidades necesarias, seguidas de la selecci&#243;n e instalaci&#243;n de productos que satisfagan esas necesidades de la arquitectura.&lt;/p&gt;
&lt;h3&gt;Ruta de datos&lt;/h3&gt;
&lt;p&gt;La ruta de datos empieza con el dise&#241;o de un modelo dimensional como objetivo para enfrentarse a los requisitos del negocio, mientras consideramos las realidades de datos subyacentes. El mundo Kimball es sin&#243;nimo del modelo dimensional donde los datos se dividen en medidas o dimensiones descriptivas. Los modelos dimensionales pueden estar instanciados en bases de datos relacionales, referidas como esquemas de estrella, o bases de datos multidimensionales, conocidas como los cubos OLAP. Independientemente de la plataforma, los modelos dimensionales intentar dirigirse a dos objetivos simult&#225;neos: facilidad de uso desde la perspectiva de los usuarios y r&#225;pidez en la realizaci&#243;n de la consulta.&lt;/p&gt;
&lt;p&gt;La matriz empresarial (EDW Bus Matrix) es un entregable clave ya que representa  el n&#250;cleo de los procesos empresariales de la organizaci&#243;n y las dimensiones conformadas comunes asociadas. Es el prototipo de datos para asegurar la integraci&#243;n de la empresa de arriba abajo con un intercambio manejable desde abajo hacia arriba centr&#225;ndose en un &#250;nico proceso de negocio a la vez. La matriz en bus  es tremendamente importante porque sirve simult&#225;neamente como una gu&#237;a t&#233;cnica, una gu&#237;a para gestionar, y un f&#243;rum para comunicarse con ejecutivos.&lt;/p&gt;
&lt;p&gt;El modelo dimensional se convierte en un dise&#241;o f&#237;sico donde las estrategias de optimizaci&#243;n del rendimiento son tomadas en cuenta. De esta manera, se aborda el dise&#241;o del sistema ETL y los desaf&#237;os para el desarrollo. El ciclo de vida describe 34 subsistemas del proceso de extracci&#243;n transformaci&#243;n y carga (ETL). Estos subsistemas  se agrupan en 4 operaciones mayores: (1) extraer los datos de la fuente, (2) llevar a cabo la limpieza y el ajuste de las transformaciones; (3) proporcionar los datos en la capa de presentaci&#243;n y (4) dirigir el proceso ETL de mantenimiento y entorno.&lt;/p&gt;
&lt;h3&gt;Ruta de la inteligencia de negocios&lt;/h3&gt;
&lt;p&gt;Mientras que algunos miembros de proyectos est&#225;n inmersos en la tecnolog&#237;a y los datos, otros se centran en identificar y construir un amplio rango de  aplicaciones BI, incluyendo informes estandarizados, consultas parametrizadas, tableros, cuadros de mando, modelos anal&#237;ticos, aplicaciones de extracci&#243;n de datos junto con las interfaces de navegaci&#243;n asociadas.&lt;/p&gt;
&lt;h3&gt;Implementaci&#243;n, mantenimiento y crecimiento:&lt;/h3&gt;
&lt;p&gt;Las tres rutas de ciclos de vida convergen en la implementaci&#243;n, reuniendo la tecnolog&#237;a, los datos y las aplicaciones BI. La implementaci&#243;n iterada entra en fase de mantenimiento, mientras que el crecimiento vuelve atr&#225;s hacia la planificaci&#243;n del proyecto para la pr&#243;xima iteraci&#243;n del sistema DW/BI. Recuerda que el sistema DW/BI es un proceso a largo plazo, &#161;no un proyecto que se hace una sola vez!.&lt;/p&gt;
&lt;p&gt;A lo largo del ciclo de vida Kimball, hay un tema recurrente reconociendo que los profesionales del DW/BI deben combinar los requerimientos de los usuarios de negocio con las realidades subyacentes de los datos fuente, tecnolog&#237;a y recursos relacionados. Los equipos de proyecto que se centran exclusivamente en las necesidades (o realidades) de un modo aislado, inevitablemente tendr&#225;n que hacer frente a riesgos en forma de retrasos en las entregas y/o adopci&#243;n por parte de los usuarios.&lt;/p&gt;
&lt;p&gt;Finalmente, como hemos dicho en otras ocasiones, y seguro que repetiremos en el  futuro: Independientemente de los objetivos espec&#237;ficos DW/BI de tu organizaci&#243;n, creemos que tu objetivo general debe ser la aceptaci&#243;n por parte de los usuarios de negocio del DW/BI para el apoyar la toma de decisiones. Este objetivo debe permanecer en el ojo del hurac&#225;n durante el dise&#241;o, desarrollo e implementaci&#243;n del ciclo de vida de cualquier sistema data warehouse o business intelligence.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2011/135-dimensiones-conformadas-fundamento-datawarehouse-agil.html</guid>
      <link>https://datawarehouse.es/2011/135-dimensiones-conformadas-fundamento-datawarehouse-agil.html</link>
      <title>Consejo de dise&#241;o #135: Las dimensiones conformadas como fundamento de un data warehouse &#225;gil</title>
      <pubDate>Thu, 03 Nov 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-11-03T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/2011-135-dimensiones-conformadas-fundamento-datawarehouse-agil.jpg&quot; /&gt;
	  &lt;h2&gt;Consejo de dise&#241;o #135&lt;/h2&gt;
&lt;p&gt;Algunos clientes y estudiantes lamentan que cuando quieren entregar y compartir dimensiones maestras definidas consistentemente en el entorno DWH/BI, simplemente, &amp;quot;no se puede&amp;quot;. Explican que lo har&#237;an si pudiesen, pero con una alta direcci&#243;n centrada en utilizar t&#233;cnicas de desarrollo &#225;gil para ofrecer soluciones DW/BI, es &amp;quot;imposible&amp;quot; tener tiempo para llegar a un acuerdo en toda la organizaci&#243;n sobre dimensiones conformadas. Quiero llevar a cabo este argumento al rev&#233;s afirmando que &lt;strong&gt;las dimensiones conformadas permiten el desarrollo &#225;gil de DW/BI  y agiliza la toma de decisiones&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;Se&#225;is o no un especialista Kimball, muchos de vosotros est&#225;is familiarizados con las dimensiones conformadas. Una dimensi&#243;n conformada es un dato maestro descriptivo que est&#225; referenciado en m&#250;ltiples modelos dimensionales. Las dimensiones conformadas son fundamentales dentro del enfoque Kimball. Las dimensiones conformadas permiten a  los usuarios del DW/BI cortar y fragmentar constantemente las m&#233;tricas de rendimiento de los procesos de fuentes de datos procedentes de m&#250;ltiples empresas. Las dimensiones conformadas permiten que datos de diferentes fuentes sean integrados bas&#225;ndose en atributos de dimensiones comunes y unificados. Finalmente, las dimensiones conformadas permiten construir y mantener una tabla de datos una sola vez en lugar de recrear versiones ligeramente diferentes durante cada ciclo de desarrollo.&lt;/p&gt;
&lt;p&gt;Reutilizando dimensiones conformadas entre proyectos es  donde se obtiene un impulso para obtener m&#225;s agilidad en el desarrollo  DW/BI. A medida que desarrollas tu portfolio de dimensiones maestras conformadas, la manivela de desarrollo del proyecto empieza a girar m&#225;s r&#225;pido.&lt;/p&gt;
&lt;p&gt;El &lt;em&gt;time-to-market&lt;/em&gt; de una nueva fuente de datos empresarial se reduce a medida que los desarrolladores reutilizan dimensiones conformadas existentes. Finalmente, los nuevos desarrollos ETL se centrar&#225;n casi exclusivamente en entregar m&#225;s tablas de hechos a medida que las tablas de dimensiones asociadas preparadas en su estanter&#237;a listas para ser utilizadas.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Definir una dimensi&#243;n conformada requiere un consenso organizacional y compromiso en la organizaci&#243;n.&lt;/strong&gt; No es necesario que todos est&#233;n de acuerdo con cada atributo en cada tabla dimensional. Como m&#237;nimo, deber&#237;as identificar un subconjunto de atributos que tenga significado en la empresa. Estas caracter&#237;sticas descriptivas comunes son el punto de partida de los atributos conformados.&lt;/p&gt;
&lt;p&gt;A lo largo del tiempo, puedes expandir este sencillo punto de partida de manera iterativa. Ninguno de los atributos dimensionales especiales procedentes de un solo proceso empresarial no deben ser descartados durante el proceso de conformaci&#243;n (asumimos muy pocos compromisos definitivos). Y finalmente, si tu organizaci&#243;n ya ha implementado la capacidad de &lt;em&gt;master data managment&lt;/em&gt; (MDM) para apoyar el sistema de fuente transaccional, el trabajo de crear dimensiones conformadas para el almac&#233;n de datos de la empresa, ser&#225; m&#225;s sencillo.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Si fallas en concentrarte en las dimensiones conformadas porque est&#225;s bajo presi&#243;n de entregar alguna cosa, los distintos departamentos anal&#237;ticos de silos de datos probablemente tendr&#225;n categor&#237;as y etiquetas inconsistentes&lt;/strong&gt;. O peor: Los conjuntos de datos ofrecer&#225;n la apariencia de poder ser comparados y integrados debido a la similitud de sus etiquetas, pero las reglas empresariales subyacentes ser&#225;n ligeramente diferentes. Los usuarios de negocio malgastar&#225;n cantidades exageradas de tiempo intentando componer y resolver estas inconsistencias en los datos que influir&#225;n negativamente en su agilidad para la toma de decisiones.&lt;/p&gt;
&lt;p&gt;Los altos directivos de IT que demandan desarrollo de sistemas &#225;giles, si est&#225;n interesados en conseguir eficiencia en el desarrollo a largo plazo y quieren una toma de decisiones efectiva en la empresa a largo plazo, deber&#225;n ejercer incluso una mayor presi&#243;n a la organizaci&#243;n para definir dimensiones conformadas consistentes .&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://datawarehouse.es/2013/dar-sentido-capa-semnatica.html</guid>
      <link>https://datawarehouse.es/2013/dar-sentido-capa-semnatica.html</link>
      <title>Consejo de dise&#241;o #158: Dar sentido a la capa sem&#225;ntica</title>
      <pubDate>Thu, 03 Nov 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-11-03T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://datawarehouse.es/blog/images/&quot; /&gt;
	  &lt;p&gt;Uno de los componentes clave de la arquitectura de un sistema Business Intelligence es la capa sem&#225;ntica. La capa sem&#225;ntica proporciona la traducci&#243;n de las estructuras subyacentes de la base de datos en t&#233;rminos y construcciones orientados  al usuario de negocio. Normalmente es una parte integrante de la herramienta de consulta e informe. Los sistemas OLAP o las bases de datos multi-dimensionales (cubos) tambi&#233;n incluyen una capa sem&#225;ntica.&lt;/p&gt;
&lt;p&gt;Algunas sistemas BI proporcionan capas sem&#225;nticas microsc&#243;picamente peque&#241;as, otras son ricas y robustas. La funcionalidad m&#237;nima para poder calificarse como una capa sem&#225;ntica incluye:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Una organizaci&#243;n que presenta los elementos de modo intuitivo para la gente de negocios. En la mayor&#237;a de las herramientas organizar&#225;s las tablas y columnas en estructuras de carpetas. El m&#233;todo Kimball te aconseja estructurar dimensionalmente tu almac&#233;n de datos, lo cu&#225;l te sit&#250;a por delante de aquellos que intentan lanzar BI directamente sobre estructuras de bases de datos transaccionales. Pero incluso si rehaces sobre un modelo dimensional limpio, una capa sem&#225;ntica proporcionar&#225; oportunidades para mejorar la navegabilidad y la capacidad de encontrar.&lt;/li&gt;
&lt;li&gt;Una oportunidad para renombrar los elementos de datos para que los usuarios de negocios encuentren sentido. Por supuesto, el m&#233;todo Kimball recomienda encarecidamente que las tablas y columnas del almac&#233;n de la base de datos sean nombrados como a los usuarios les gustar&#237;a verlos, pero esta funcionalidad se implementa a veces en la capa sem&#225;ntica.&lt;/li&gt;
&lt;li&gt;Una interfaz  para mantener las descripciones de los elementos de datos orientadas al negocio. Idealmente, tu almacenas y expones m&#250;ltiples tipos de metadatos: descripciones de negocios, valores de ejemplo, y la pol&#237;tica de cambios en las dimensiones de los atributos. En un mundo perfecto, la capa sem&#225;ntica de la BI expondr&#237;a al completo el n&#250;mero de l&#237;neas de cada elemento: que sistema de transacci&#243;n de datos era la fuente, que operario de ETL toc&#243;  este atributo, y cuando fue cargado en el almac&#233;n de datos. De modo realista, pocas capas sem&#225;nticas soportan m&#225;s de una &#250;nica descripci&#243;n para cada elemento de datos. En mi experiencia, la mayor&#237;a de equipos de DW/BI ni se molestan en enriquecer esa &#250;nica descripci&#243;n.&lt;/li&gt;
&lt;li&gt;Un mecanismo para definir reglas de c&#225;lculo y agregaci&#243;n. Por ejemplo, debes definir en el modelo sem&#225;ntico que balances de inventario son aditivos a trav&#233;s de la mayor&#237;a dimensiones, pero cuando se agregan a trav&#233;s del tiempo, necesitas tomar el periodo final del balance o dividir la suma de balances entre el n&#250;mero de periodos de tiempo.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#191;La capa semantica es un complemento obligatorio de la arquitectura DW/BI? La respuesta es s&#237;, si planeas abrir tus puertas  a tu sistema DW/BI para un uso ad hoc. &lt;strong&gt;Cada hora que utilices construyendo una capa sem&#225;ntica rica se ver&#225; recompensada con las mejoras adoptadas y el &#233;xito en la comunidad de usuarios.&lt;/strong&gt; No ejecutes simplemente el asistente de tu herramienta BI que  genera una capa sem&#225;ntica equivalente a las tablas subyacentes (incluso si son dimensionales). Dedica tiempo para hacerla lo m&#225;s racional y precisa que puedas.&lt;/p&gt;
&lt;p&gt;La desventaja de invertir en una capa sem&#225;ntica es que tendr&#225;s que realizar la inversi&#243;n m&#250;ltiples veces. La mayor&#237;a de organizaciones se encuentran con que necesitan varias herramientas BI para encontrar las diversas necesidades de sus comunidades de usuarios. Cada herramienta tiene su propia capa sem&#225;ntica, que raramente puede ser copiada de una herramienta a otra (incluso en herramientas vendidas por el mismo vendedor). Uno de los muchos retos para los equipos de BI es mantener una apariencia y estructura organizacional similares en todas las herramientas BI. De nuevo, el m&#233;todo Kimball enfatiza que conseguir el modelo relacional correcto de datos dimensionales facilitar&#225; considerablemente la tarea de crear la capa sem&#225;ntica (haciendo m&#225;s fina la capa sem&#225;ntica de la herramienta BI).&lt;/p&gt;
&lt;p&gt;S&#243;lo hay un escenario donde me quedar&#237;a el argumento de que puedes funcionar sin una capa sem&#225;ntica. Si las puertas de tu sistema DW/BI est&#225;n cerradas a todos los usuarios ad hoc, y todo el acceso est&#225; intermediado por desarrolladores de informes corporativos, puedes hacerla funcionar sin una capa sem&#225;ntica BI. Esta es una recomendaci&#243;n no deseada en diversos frentes. Lo m&#225;s importante, &#191;c&#243;mo puedes cerrar las puertas a los usuarios ad hoc? Es una locura. Adicionalmente, los desarrolladores son personas tambi&#233;n e incluso pueden escribir SQL a mano y buscar definiciones en un diccionario de datos externo, Pero, &#191;por qu&#233; torturarlos?&lt;/p&gt;
&lt;p&gt;Si te quedas con el argumento de que necesitas una capa sem&#225;ntica, tu pr&#243;xima pregunta puede ser si necesitas un datawarehouse dimensional. Algunos observadores, especialmente algunos vendedores de herramientas BI, argumentan que puedes omitir el almac&#233;n de datos relacional y proporcionar la experiencia dimensional virtualmente. Esto suena atractivo, ya que nadie quiere realmente construir un sistema ETL, pero es una quimera. &lt;strong&gt;Ninguna herramienta de capa sem&#225;ntica proporciona la funcionalidad de transformaci&#243;n e integraci&#243;n de una herramienta ETL.&lt;/strong&gt; La mayor&#237;a de herramientas BI son estupendas en lo que hacen; no las corrompas por intentar hacer un ETL en la capa sem&#225;ntica. Y no olvides que el mantenimiento del ETL a&#241;ade valor a los datos limpiando, estandarizando, conformando y des-duplicando. Todos estos pasos una herramienta BI sencillamente no puede hacer.&lt;/p&gt;
&lt;p&gt;Lo dicho: He trabajado con clientes que han tenido &#233;xito enganchando una herramienta BI directamente al modelo de datos normalizado (transaccional o ODS). El escenario m&#225;s com&#250;n es un prototipo: Ense&#241;&#233;mosle a la gente  como ser&#237;a un universo de objetos de negocios o una interfaz Tableau para generar entusiasmo y apoyo financiero para un proyecto Business Intelligence.&lt;/p&gt;
&lt;p&gt;Otro escenario seria conocer los informes de requerimientos operacionales mediante la construcci&#243;n de una capa sem&#225;ntica sobre el sistema transaccional. Pero, en la mayor&#237;a de casos, esta capa sem&#225;ntica operacional es un componente relativamente menor en un entorno anal&#237;tico de una empresa que incluye un DWH real. Soy muy esc&#233;ptico con cualquier organizaci&#243;n que proclama que sus sistemas transaccionales est&#225;n lo suficientemente limpios, y sus necesidades anal&#237;ticas son bastante simples, que no necesitan  instanciar sus modelos dimensionales. No me opongo a la idea en la teor&#237;a, pero en la pr&#225;ctica todav&#237;a no lo veo funcionando.&lt;/p&gt;
&lt;p&gt;No creo que haya visto alguna vez que una organizaci&#243;n sobre-invirtiese en una capa sem&#225;ntica, pero he visto muchos data warehouses fallar debido a la falta de inversi&#243;n. Adquiere una herramienta BI decente (hay docenas), e invierte tiempo desarrollando la capa sem&#225;ntica. De lo contrario estar&#225;s subestimando tu sustancial inversi&#243;n en dise&#241;o y desarrollo de un data warehouse t&#233;cnicamente solido.&lt;/p&gt;
	   
	  
	  &lt;/div&gt;</description>
</item>


   
</channel>
</rss>
